-----------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/nisailing/Desktop/ECO372/ECO372_A2/ECO372_Assignment2_NI_Sailing.log
  log type:  text
 opened on:   8 Mar 2021, 05:46:40

. set more off    // This tells Stata to automatically continue if displays exceed screen capacity, i
> nstead of making the user click

. clear                   // Removes any data from memory every time this script is run.

. set seed `studentnumber' // Fixes randomization issues

. display "ECO372_Assignment2 " _n "`surname' `firstname' `studentnumber'" _n c(current_date) c(curre
> nt_time)
ECO372_Assignment2 
NI Sailing 1004936019
 8 Mar 202105:46:40

.                                                                                                    
>                                              
. 
. /*      ====================================
>         ============ EXERCISE  =============
>         ==================================== */
. 
. use "datasets/LaLonde_experimental.dta", clear                  

. datasignature                                                                           // checks d
> ata integrity                        
  722:10(110271):1946935910:3093711506

. 
. // your code for the Exercise questions a-f goes below this
. 
. //Question a
. reg age treat,robust

Linear regression                               Number of obs     =        722
                                                F(1, 720)         =       0.13
                                                Prob > F          =     0.7216
                                                R-squared         =     0.0002
                                                Root MSE          =       6.63

------------------------------------------------------------------------------
             |               Robust
         age |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .1792038   .5026692     0.36   0.722    -.8076687    1.166076
       _cons |   24.44706   .3197422    76.46   0.000     23.81932     25.0748
------------------------------------------------------------------------------

. reg education treat,robust

Linear regression                               Number of obs     =        722
                                                F(1, 720)         =       2.14
                                                Prob > F          =     0.1441
                                                R-squared         =     0.0031
                                                Root MSE          =     1.7033

------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .1922361   .1314755     1.46   0.144     -.065885    .4503572
       _cons |   10.18824   .0785342   129.73   0.000     10.03405    10.34242
------------------------------------------------------------------------------

. reg black treat,robust

Linear regression                               Number of obs     =        722
                                                F(1, 720)         =       0.00
                                                Prob > F          =     0.9645
                                                R-squared         =     0.0000
                                                Root MSE          =     .40014

------------------------------------------------------------------------------
             |               Robust
       black |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0013468   .0302489     0.04   0.964    -.0580399    .0607335
       _cons |         .8   .0194298    41.17   0.000     .7618542    .8381458
------------------------------------------------------------------------------

. reg hispanic treat,robust

Linear regression                               Number of obs     =        722
                                                F(1, 720)         =       0.66
                                                Prob > F          =     0.4154
                                                R-squared         =     0.0009
                                                Root MSE          =     .30718

------------------------------------------------------------------------------
             |               Robust
    hispanic |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -.0186651    .022906    -0.81   0.415    -.0636357    .0263055
       _cons |   .1129412   .0153748     7.35   0.000     .0827563     .143126
------------------------------------------------------------------------------

. reg married treat,robust

Linear regression                               Number of obs     =        722
                                                F(1, 720)         =       0.15
                                                Prob > F          =     0.7028
                                                R-squared         =     0.0002
                                                Root MSE          =     .36897

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0107031   .0280365     0.38   0.703    -.0443399    .0657461
       _cons |   .1576471    .017701     8.91   0.000     .1228953    .1923988
------------------------------------------------------------------------------

. reg nodegree treat,robust

Linear regression                               Number of obs     =        722
                                                F(1, 720)         =       6.82
                                                Prob > F          =     0.0092
                                                R-squared         =     0.0098
                                                Root MSE          =     .41293

------------------------------------------------------------------------------
             |               Robust
    nodegree |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -.0834779   .0319616    -2.61   0.009     -.146227   -.0207288
       _cons |   .8141176    .018896    43.08   0.000     .7770197    .8512155
------------------------------------------------------------------------------

. 
. //Question b
. reg re78 treat,robust

Linear regression                               Number of obs     =        722
                                                F(1, 720)         =       3.30
                                                Prob > F          =     0.0698
                                                R-squared         =     0.0049
                                                Root MSE          =       6242

------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   886.3037   488.1385     1.82   0.070    -72.04121    1844.649
       _cons |   5090.048   277.4261    18.35   0.000     4545.388    5634.709
------------------------------------------------------------------------------

. 
. //Question c
. gen age_sqrd=age^2

. reg re78 treat age age_sqrd black education hispanic nodegree,robust

Linear regression                               Number of obs     =        722
                                                F(7, 714)         =       2.71
                                                Prob > F          =     0.0089
                                                R-squared         =     0.0238
                                                Root MSE          =     6208.4

------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   798.3512    488.168     1.64   0.102    -160.0653    1756.768
         age |  -3.805475   193.7217    -0.02   0.984    -384.1378    376.5268
    age_sqrd |   .5296508   3.197424     0.17   0.868    -5.747827    6.807128
       black |  -1762.833    774.898    -2.27   0.023    -3284.184   -241.4815
   education |   219.7946   165.5418     1.33   0.185    -105.2124    544.8015
    hispanic |   -117.148   983.6556    -0.12   0.905    -2048.351    1814.055
    nodegree |  -494.2816   756.7119    -0.65   0.514    -1979.928    991.3648
       _cons |   4430.163   3594.725     1.23   0.218    -2627.333    11487.66
------------------------------------------------------------------------------

. 
. //Question d
. reg re78 treat age age_sqrd black education hispanic nodegree

      Source |       SS           df       MS      Number of obs   =       722
-------------+----------------------------------   F(7, 714)       =      2.48
       Model |   670296792         7  95756684.6   Prob > F        =    0.0159
    Residual |  2.7520e+10       714  38543836.8   R-squared       =    0.0238
-------------+----------------------------------   Adj R-squared   =    0.0142
       Total |  2.8191e+10       721  39099301.3   Root MSE        =    6208.4

------------------------------------------------------------------------------
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   798.3512   472.1283     1.69   0.091    -128.5747    1725.277
         age |  -3.805475   211.1663    -0.02   0.986    -418.3866    410.7756
    age_sqrd |   .5296508   3.556177     0.15   0.882    -6.452164    7.511466
       black |  -1762.833     803.88    -2.19   0.029    -3341.084   -184.5814
   education |   219.7946   182.9296     1.20   0.230    -139.3496    578.9387
    hispanic |   -117.148   1054.228    -0.11   0.912    -2186.906     1952.61
    nodegree |  -494.2816   749.2561    -0.66   0.510     -1965.29     976.727
       _cons |   4430.163   3653.224     1.21   0.226    -2742.183    11602.51
------------------------------------------------------------------------------

. 
. //Question f
. ttest re78,by(treat)

Two-sample t test with equal variances
------------------------------------------------------------------------------
   Group |     Obs        Mean    Std. Err.   Std. Dev.   [95% Conf. Interval]
---------+--------------------------------------------------------------------
       0 |     425    5090.048     277.368    5718.089    4544.861    5635.236
       1 |     297    5976.352    401.7594    6923.796    5185.685    6767.019
---------+--------------------------------------------------------------------
combined |     722    5454.636    232.7105    6252.943    4997.765    5911.507
---------+--------------------------------------------------------------------
    diff |           -886.3037    472.0863               -1813.134    40.52635
------------------------------------------------------------------------------
    diff = mean(0) - mean(1)                                      t =  -1.8774
Ho: diff = 0                                     degrees of freedom =      720

    Ha: diff < 0                 Ha: diff != 0                 Ha: diff > 0
 Pr(T < t) = 0.0304         Pr(|T| > |t|) = 0.0609          Pr(T > t) = 0.9696

. 
. 
. 
. use "datasets/LaLonde_PSID3.dta", clear                 

. datasignature                                                                           // checks d
> ata integrity                        
  425:10(110271):306486245:2034798792

. 
. // your code for the Exercise questions g-l goes below this
. 
. //Question h
. reg age treat,robust

Linear regression                               Number of obs     =        425
                                                F(1, 423)         =     128.56
                                                Prob > F          =     0.0000
                                                R-squared         =     0.3261
                                                Root MSE          =     9.0109

------------------------------------------------------------------------------
             |               Robust
         age |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -13.63155   1.202261   -11.34   0.000     -15.9947    -11.2684
       _cons |   38.25781   1.137848    33.62   0.000     36.02127    40.49435
------------------------------------------------------------------------------

. reg education treat,robust

Linear regression                               Number of obs     =        425
                                                F(1, 423)         =       0.06
                                                Prob > F          =     0.8004
                                                R-squared         =     0.0002
                                                Root MSE          =      2.311

------------------------------------------------------------------------------
             |               Robust
   education |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .0757839   .2995041     0.25   0.800    -.5129178    .6644855
       _cons |   10.30469   .2802907    36.76   0.000     9.753751    10.85562
------------------------------------------------------------------------------

. reg black treat,robust

Linear regression                               Number of obs     =        425
                                                F(1, 423)         =      48.82
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1207
                                                Root MSE          =     .43215

------------------------------------------------------------------------------
             |               Robust
       black |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .3482218   .0498361     6.99   0.000     .2502645    .4461791
       _cons |    .453125   .0441034    10.27   0.000     .3664358    .5398142
------------------------------------------------------------------------------

. reg hispanic treat,robust

Linear regression                               Number of obs     =        425
                                                F(1, 423)         =       0.48
                                                Prob > F          =     0.4902
                                                R-squared         =     0.0012
                                                Root MSE          =     .30209

------------------------------------------------------------------------------
             |               Robust
    hispanic |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -.0229114   .0331801    -0.69   0.490    -.0881299    .0423071
       _cons |   .1171875   .0284967     4.11   0.000     .0611748    .1732002
------------------------------------------------------------------------------

. reg married treat,robust

Linear regression                               Number of obs     =        425
                                                F(1, 423)         =     129.97
                                                Prob > F          =     0.0000
                                                R-squared         =     0.2655
                                                Root MSE          =       .403

------------------------------------------------------------------------------
             |               Robust
     married |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |  -.5269623    .046223   -11.40   0.000    -.6178177    -.436107
       _cons |   .6953125    .040779    17.05   0.000     .6151578    .7754672
------------------------------------------------------------------------------

. reg nodegree treat,robust

Linear regression                               Number of obs     =        425
                                                F(1, 423)         =      18.90
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0468
                                                Root MSE          =      .4624

------------------------------------------------------------------------------
             |               Robust
    nodegree |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   .2228272   .0512607     4.35   0.000     .1220698    .3235846
       _cons |   .5078125   .0442931    11.46   0.000     .4207505    .5948745
------------------------------------------------------------------------------

. 
. //Question i
. reg re78 treat,robust

Linear regression                               Number of obs     =        425
                                                F(1, 423)         =       0.77
                                                Prob > F          =     0.3807
                                                R-squared         =     0.0020
                                                Root MSE          =       7186

------------------------------------------------------------------------------
             |               Robust
        re78 |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       treat |   697.0584   794.3192     0.88   0.381     -864.246    2258.363
       _cons |   5279.294   685.0659     7.71   0.000     3932.736    6625.851
------------------------------------------------------------------------------

. reg re78 treat age age_sqrd black education hispanic nodegree
variable age_sqrd not found
r(111);

end of do-file

r(111);

