------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/nisailing/Desktop/ECO372/ECO372_A4/ECO372_Assignment4_NI_Sailing.log
  log type:  text
 opened on:  14 Apr 2021, 09:55:06

. set more off    // This tells Stata to automatically continue if displays exceed screen capacity, in
> stead of making user click

. clear                   // Removes any data from memory every time this script is run.

. display "ECO372_Assignment4 " _n "`surname' `firstname' `studentnumber'" _n c(current_date) c(curren
> t_time)
ECO372_Assignment4 
NI Sailing 1004936019
14 Apr 202109:55:06

. 
. /*      =============================================================
>         ============ EXERCISE 1 ============
>         ============================================================= */
. 
. use "datasets/AganStarr2018.dta", clear                 // If your files are placed correctly, you s
> hould not need to change that 

. datasignature                                                                   // checks data integ
> rity                                                                                                
>         
  14637:13(9466):1779764690:3585737515

. 
. // YOUR COMMANDS FOR EXERCISE 1 GO HERE
. 
. //Question (b)
. //Use table command to produce a table for characteristics
. table post, contents(mean white mean crime mean ged mean empgap mean box)

--------------------------------------------------------------------------------
=1 if     |
post-BTB  |
period,   |
=0 if     |
pre-BTB   |
period    |  mean(white)   mean(crime)     mean(ged)  mean(empgap)     mean(box)
----------+---------------------------------------------------------------------
      Pre |     .5024155      .4970324      .4977226      .4923396      .3664596
     Post |     .4967532      .5128517      .5021645      .5041937       .035579
--------------------------------------------------------------------------------

. //Use table command to produce a table for results
. table post, contents(mean posresponse mean interview)

------------------------------------------
=1 if     |
post-BTB  |
period,   |
=0 if     |
pre-BTB   |
period    | mean(posres~e)  mean(interv~w)
----------+-------------------------------
      Pre |       .1094548        .0597654
     Post |       .1247294        .0669643
------------------------------------------

. 
. //Question (c)
. // regress each characteristics on pre
. reg white pre, robust

Linear regression                               Number of obs     =     14,637
                                                F(1, 14635)       =       0.47
                                                Prob > F          =     0.4934
                                                R-squared         =     0.0000
                                                Root MSE          =     .50003

------------------------------------------------------------------------------
             |               Robust
       white |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pre |   .0056622   .0082664     0.68   0.493     -.010541    .0218655
       _cons |   .4967532   .0058158    85.41   0.000     .4853535     .508153
------------------------------------------------------------------------------

. reg crime pre, robust

Linear regression                               Number of obs     =     14,637
                                                F(1, 14635)       =       3.66
                                                Prob > F          =     0.0556
                                                R-squared         =     0.0003
                                                Root MSE          =     .49995

------------------------------------------------------------------------------
             |               Robust
       crime |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pre |  -.0158193   .0082651    -1.91   0.056      -.03202    .0003814
       _cons |   .5128517    .005814    88.21   0.000     .5014556    .5242479
------------------------------------------------------------------------------

. reg ged pre, robust

Linear regression                               Number of obs     =     14,637
                                                F(1, 14635)       =       0.29
                                                Prob > F          =     0.5910
                                                R-squared         =     0.0000
                                                Root MSE          =     .50003

------------------------------------------------------------------------------
             |               Robust
         ged |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pre |  -.0044419   .0082665    -0.54   0.591    -.0206453    .0117614
       _cons |   .5021645   .0058159    86.34   0.000     .4907647    .5135643
------------------------------------------------------------------------------

. reg empgap pre, robust

Linear regression                               Number of obs     =     14,637
                                                F(1, 14635)       =       2.06
                                                Prob > F          =     0.1516
                                                R-squared         =     0.0001
                                                Root MSE          =         .5

------------------------------------------------------------------------------
             |               Robust
      empgap |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pre |  -.0118542   .0082659    -1.43   0.152    -.0280565    .0043481
       _cons |   .5041937   .0058157    86.69   0.000     .4927942    .5155933
------------------------------------------------------------------------------

. reg box pre, robust

Linear regression                               Number of obs     =     14,637
                                                F(1, 14635)       =    2983.80
                                                Prob > F          =     0.0000
                                                R-squared         =     0.1715
                                                Root MSE          =     .36368

------------------------------------------------------------------------------
             |               Robust
         box |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         pre |   .3308806   .0060574    54.62   0.000     .3190074    .3427539
       _cons |    .035579   .0021547    16.51   0.000     .0313556    .0398024
------------------------------------------------------------------------------

. 
. //Question (d)
. // first, regress posresponse on all variables
. // store regression result
. reg posresponse white crime ged empgap pre i.center i.chain_id, cluster(chain_id)

Linear regression                               Number of obs     =     14,637
                                                F(87, 292)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1793
                                                Root MSE          =     .29523

                             (Std. Err. adjusted for 293 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
 posresponse |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       white |   .0242025   .0056273     4.30   0.000     .0131273    .0352776
       crime |  -.0128873   .0054512    -2.36   0.019    -.0236159   -.0021587
         ged |  -.0051913   .0050413    -1.03   0.304    -.0151133    .0047306
      empgap |   .0012501   .0045806     0.27   0.785     -.007765    .0102652
         pre |  -.0150826    .010163    -1.48   0.139    -.0350847    .0049195
             |
      center |
          2  |   .0346654   .0367432     0.94   0.346    -.0376497    .1069805
          3  |   .0178232    .031377     0.57   0.570    -.0439305     .079577
          4  |   .0044014   .0292603     0.15   0.881    -.0531865    .0619893
          5  |   -.028394   .0308675    -0.92   0.358    -.0891451     .032357
          6  |    .025521   .0314911     0.81   0.418    -.0364573    .0874994
          7  |  -.0261492   .0331077    -0.79   0.430    -.0913092    .0390108
          8  |   -.001666   .0319946    -0.05   0.959    -.0646352    .0613033
          9  |  -.0019949   .0329567    -0.06   0.952    -.0668578     .062868
         10  |  -.0167158   .0327789    -0.51   0.610    -.0812286     .047797
         11  |   .0423894   .0359517     1.18   0.239    -.0283678    .1131466
         12  |   .0050144    .029985     0.17   0.867    -.0539996    .0640285
         13  |  -.0013819   .0379262    -0.04   0.971    -.0760253    .0732615
         14  |  -.0301329    .029036    -1.04   0.300    -.0872793    .0270134
         15  |   .0125554   .0296672     0.42   0.672    -.0458333     .070944
         16  |   .0007321   .0307097     0.02   0.981    -.0597084    .0611725
         17  |   .0011658   .0315234     0.04   0.971    -.0608761    .0632077
         18  |  -.0374041   .0410352    -0.91   0.363    -.1181663    .0433581
         19  |  -.0158882   .0289574    -0.55   0.584    -.0728799    .0411034
         20  |  -.0208472   .0272267    -0.77   0.444    -.0744326    .0327382
         21  |   .0258873   .0449954     0.58   0.566    -.0626691    .1144437
         22  |   .0249553   .0353138     0.71   0.480    -.0445466    .0944573
         23  |  -.0041297   .0297248    -0.14   0.890    -.0626318    .0543724
         24  |  -.0244064   .0305144    -0.80   0.424    -.0844625    .0356496
         25  |   .0128183   .0299276     0.43   0.669    -.0460828    .0717195
         26  |     .01913   .0400373     0.48   0.633    -.0596682    .0979282
         27  |   .0333646   .0409432     0.81   0.416    -.0472165    .1139457
         28  |   .0496262   .0372076     1.33   0.183    -.0236029    .1228553
         29  |   .0147512    .036626     0.40   0.687    -.0573332    .0868356
         30  |   .0014072   .0342337     0.04   0.967    -.0659689    .0687833
         31  |   .0410302   .0416165     0.99   0.325    -.0408761    .1229364
         32  |  -.0047559   .0331446    -0.14   0.886    -.0699886    .0604767
         33  |   .0061819   .0364434     0.17   0.865    -.0655432     .077907
         34  |   -.002351   .0297777    -0.08   0.937    -.0609572    .0562552
         35  |   .0130252   .0306138     0.43   0.671    -.0472264    .0732768
         36  |   .0565225   .0392517     1.44   0.151    -.0207296    .1337747
         37  |   .0147259   .0405851     0.36   0.717    -.0651505    .0946022
         38  |   .0466141   .0477953     0.98   0.330    -.0474529    .1406811
         39  |  -.0150838   .0277981    -0.54   0.588     -.069794    .0396263
         40  |    .046576   .0413344     1.13   0.261    -.0347752    .1279272
         41  |   .0243237   .0403477     0.60   0.547    -.0550855    .1037328
         42  |   -.005722   .0316216    -0.18   0.857    -.0679571     .056513
         43  |   .0460411   .0425235     1.08   0.280    -.0376504    .1297325
         44  |   .0478267   .0430769     1.11   0.268    -.0369538    .1326072
        101  |   .0926485   .0487853     1.90   0.059    -.0033668    .1886639
        102  |    .128197   .0691657     1.85   0.065    -.0079296    .2643235
        103  |  -.0324926   .0510877    -0.64   0.525    -.1330393    .0680541
        104  |   .0061728   .0387274     0.16   0.873    -.0700475     .082393
        105  |   .0913706   .0493432     1.85   0.065    -.0057429     .188484
        106  |   .1042169   .0403429     2.58   0.010     .0248171    .1836167
        107  |   .0342775   .0409393     0.84   0.403     -.046296    .1148509
        108  |   .0142826   .0492337     0.29   0.772    -.0826153    .1111804
        109  |   .1824595   .0571458     3.19   0.002     .0699897    .2949293
        110  |  -.0273266    .032224    -0.85   0.397    -.0907473    .0360941
        111  |  -.0245278   .0310486    -0.79   0.430    -.0856352    .0365795
        112  |   .0418985   .0370872     1.13   0.260    -.0310935    .1148906
        113  |   .0738631   .0563161     1.31   0.191    -.0369739    .1847001
        114  |   .0403299   .0498778     0.81   0.419    -.0578357    .1384955
        115  |  -.0261283   .0470103    -0.56   0.579    -.1186504    .0663937
        116  |   .0702443   .0382769     1.84   0.067    -.0050892    .1455778
        117  |   .0718491   .0406539     1.77   0.078    -.0081627    .1518608
        118  |   .0047842    .049619     0.10   0.923    -.0928721    .1024405
        119  |  -.0048253   .0422518    -0.11   0.909    -.0879819    .0783313
        120  |   .0541019   .0372097     1.45   0.147    -.0191313    .1273352
        121  |  -.0479559   .0344453    -1.39   0.165    -.1157485    .0198368
        122  |    .062916   .0486012     1.29   0.197     -.032737     .158569
        123  |   .0447501   .0439234     1.02   0.309    -.0416965    .1311967
        124  |    .025663   .0345692     0.74   0.458    -.0423734    .0936994
        125  |   .0520853   .0523036     1.00   0.320    -.0508545    .1550252
        126  |   .0855868   .0672487     1.27   0.204    -.0467668    .2179403
        127  |   .0263415   .0345777     0.76   0.447    -.0417116    .0943946
        128  |    .031366   .0710872     0.44   0.659    -.1085421    .1712742
        129  |     .16245   .0473214     3.43   0.001     .0693157    .2555844
        130  |   .0512355   .0402945     1.27   0.205     -.028069      .13054
        131  |    .013452   .0374496     0.36   0.720    -.0602533    .0871574
        132  |   .1700595   .0914239     1.86   0.064    -.0098738    .3499927
        133  |  -.0513517   .0375657    -1.37   0.173    -.1252856    .0225822
        134  |   .0191743   .0474386     0.40   0.686    -.0741907    .1125393
        135  |   .0587287   .0380104     1.55   0.123    -.0160804    .1335378
        136  |   .0412451   .0401934     1.03   0.306    -.0378604    .1203506
        137  |  -.0868522   .0422333    -2.06   0.041    -.1699724    -.003732
        138  |   .0384644   .0376001     1.02   0.307    -.0355371     .112466
        139  |   .1511927   .0565758     2.67   0.008     .0398446    .2625408
        140  |   .1080008    .041569     2.60   0.010      .026188    .1898137
             |
    chain_id |
          2  |  -.0111483   .0470286    -0.24   0.813    -.1037063    .0814097
          3  |   .0032887    .026852     0.12   0.903    -.0495593    .0561366
          4  |   .0341549   .0341902     1.00   0.319    -.0331356    .1014454
          5  |    .071631   .0318872     2.25   0.025     .0088731     .134389
          6  |   .1731907   .0316857     5.47   0.000     .1108295    .2355519
          7  |   .5514283   .0372297    14.81   0.000     .4781557     .624701
          8  |  -.0162854   .0391779    -0.42   0.678    -.0933922    .0608214
          9  |   .0407527   .0378632     1.08   0.283    -.0337667     .115272
         10  |   .2334542   .0400639     5.83   0.000     .1546036    .3123047
         11  |   .5829737   .0360115    16.19   0.000     .5120987    .6538487
         12  |   .6993332    .027042    25.86   0.000     .6461113     .752555
         13  |   .0060689   .0125986     0.48   0.630    -.0187266    .0308644
         14  |  -.0030061   .0202169    -0.15   0.882    -.0427953    .0367832
         15  |   .0689779   .0527937     1.31   0.192    -.0349265    .1728823
         16  |   .3964183   .0272559    14.54   0.000     .3427753    .4500612
         17  |   .9139216   .0270606    33.77   0.000      .860663    .9671801
         18  |   .5436142   .0389699    13.95   0.000     .4669167    .6203117
         19  |   .5255518   .0262521    20.02   0.000     .4738844    .5772191
         20  |   .0604337   .0302422     2.00   0.047     .0009135     .119954
         21  |   .0213893   .0296572     0.72   0.471    -.0369796    .0797582
         22  |  -.0321428   .0336134    -0.96   0.340     -.098298    .0340125
         23  |   .1659324   .0279167     5.94   0.000      .110989    .2208759
         24  |   -.050102   .0437717    -1.14   0.253    -.1362499     .036046
         25  |  -.0240256   .0239051    -1.01   0.316    -.0710737    .0230225
         26  |   .4210986   .0242416    17.37   0.000     .3733883     .468809
         27  |    .023808   .0268592     0.89   0.376    -.0290541    .0766702
         28  |        .62   .0316846    19.57   0.000     .5576409     .682359
         29  |   .0205337   .0265026     0.77   0.439    -.0316266     .072694
         30  |   .0042867   .0344219     0.12   0.901    -.0634597    .0720331
         31  |   .1308155   .0267848     4.88   0.000     .0780998    .1835312
         32  |  -.0321428   .0336134    -0.96   0.340     -.098298    .0340125
         33  |   .3085224   .0293367    10.52   0.000     .2507841    .3662607
         34  |  -.0283038   .0361184    -0.78   0.434    -.0993893    .0427817
         35  |   -.013619   .0330178    -0.41   0.680    -.0786021    .0513642
         36  |   .0319349   .0234632     1.36   0.175    -.0142436    .0781133
         37  |  -.0350322   .0571222    -0.61   0.540    -.1474557    .0773913
         38  |  -.0114787   .0277795    -0.41   0.680    -.0661521    .0431947
         39  |  -.0150245   .0475172    -0.32   0.752    -.1085441     .078495
         40  |    .008317   .0283202     0.29   0.769    -.0474205    .0640546
         41  |   .5006519   .0338948    14.77   0.000     .4339428     .567361
         42  |  -.0077649   .0290462    -0.27   0.789    -.0649313    .0494015
         43  |  -.0391853   .0444962    -0.88   0.379    -.1267592    .0483886
         44  |    .032652   .0266124     1.23   0.221    -.0197244    .0850284
         45  |   .0380264   .0273587     1.39   0.166    -.0158188    .0918716
         46  |   .1916797   .0302067     6.35   0.000     .1322293    .2511302
         47  |  -.0002867   .0386231    -0.01   0.994    -.0763016    .0757283
         48  |   .0530571   .0352979     1.50   0.134    -.0164135    .1225277
         49  |   .0898382   .0232734     3.86   0.000     .0440332    .1356431
         50  |    .006528   .0303871     0.21   0.830    -.0532774    .0663335
         51  |   1.014432   .0294682    34.42   0.000     .9564347    1.072429
         52  |   .2549069   .0380411     6.70   0.000     .1800375    .3297764
         53  |    .047903   .0348532     1.37   0.170    -.0206924    .1164983
         54  |   .0203659   .0211547     0.96   0.336     -.021269    .0620009
         55  |  -.0666877   .0589056    -1.13   0.259     -.182621    .0492457
         56  |   .1958703   .0296347     6.61   0.000     .1375456    .2541951
         57  |   .1375659    .015696     8.76   0.000     .1066743    .1684575
         58  |   .2657839   .0235255    11.30   0.000     .2194828    .3120851
         59  |   .3796982   .0234513    16.19   0.000     .3335432    .4258531
         60  |   .0290019   .0280809     1.03   0.303    -.0262648    .0842686
         61  |   .3079363   .0327483     9.40   0.000     .2434837     .372389
         62  |   .0093695   .0261331     0.36   0.720    -.0420635    .0608025
         63  |  -.0102371   .0332394    -0.31   0.758    -.0756562     .055182
         64  |  -.0390913   .0333691    -1.17   0.242    -.1047657     .026583
         65  |   .0094629   .0276622     0.34   0.733    -.0449796    .0639054
         66  |   -.013715   .0473594    -0.29   0.772    -.1069241     .079494
         67  |  -.1345663   .0429762    -3.13   0.002    -.2191486   -.0499839
         68  |   .0041862   .0336857     0.12   0.901    -.0621112    .0704837
         69  |  -.0124461   .0473161    -0.26   0.793    -.1055699    .0806776
         70  |   .0632648   .0348373     1.82   0.070    -.0052992    .1318288
         71  |    .380001   .0303144    12.54   0.000     .3203385    .4396635
         72  |   -.027516   .0355155    -0.77   0.439    -.0974147    .0423828
         73  |   .2555308   .0377409     6.77   0.000     .1812521    .3298096
         74  |   .1776128   .0265934     6.68   0.000     .1252737    .2299519
         75  |   .1327617   .0282441     4.70   0.000     .0771739    .1883495
         76  |  -.0332961   .0577133    -0.58   0.564    -.1468829    .0802906
         77  |   .0517531   .0303972     1.70   0.090    -.0080723    .1115785
         78  |   .1378212   .0317708     4.34   0.000     .0752925      .20035
         79  |  -.0704263   .0343804    -2.05   0.041    -.1380911   -.0027615
         80  |   .0571235   .0302301     1.89   0.060    -.0023729    .1166199
         81  |   .2178572   .0336134     6.48   0.000      .151702    .2840125
         82  |   .1290851   .0267008     4.83   0.000     .0765347    .1816356
         83  |   .5244348   .0383081    13.69   0.000     .4490399    .5998298
         84  |   .0388804   .0320861     1.21   0.227    -.0242689    .1020296
         85  |   .1859719   .0328988     5.65   0.000      .121223    .2507208
         86  |  -.0167211   .0324038    -0.52   0.606    -.0804957    .0470535
         87  |   .0321587   .0269258     1.19   0.233    -.0208345     .085152
         88  |   .0127979   .0314407     0.41   0.684    -.0490813    .0746771
         89  |   -.010747   .0286209    -0.38   0.708    -.0670764    .0455825
         90  |   .7344405   .0309466    23.73   0.000     .6735337    .7953472
         91  |   .0185036   .0208352     0.89   0.375    -.0225027    .0595099
         92  |   .4483677   .0338668    13.24   0.000     .3817137    .5150216
         93  |   .0261664   .0304982     0.86   0.392    -.0338577    .0861905
         94  |   .6556655   .0263762    24.86   0.000     .6037539    .7075771
         95  |   .4849307   .0336968    14.39   0.000     .4186113    .5512501
         96  |   .1172943    .022283     5.26   0.000     .0734385      .16115
         97  |   .2676145   .0323667     8.27   0.000     .2039128    .3313161
         98  |  -.0262181   .0350418    -0.75   0.455    -.0951847    .0427485
         99  |   .5397227   .0266552    20.25   0.000     .4872621    .5921834
        100  |   .0793836    .026649     2.98   0.003     .0269352     .131832
        101  |   .0154977   .0242627     0.64   0.523    -.0322542    .0632496
        102  |   .1459705   .0355869     4.10   0.000     .0759311      .21601
        103  |   .0131927   .0189612     0.70   0.487    -.0241253    .0505107
        104  |   .0183553    .019803     0.93   0.355    -.0206193      .05733
        105  |   .0087538   .0374464     0.23   0.815    -.0649452    .0824528
        106  |  -.0660626   .0589122    -1.12   0.263     -.182009    .0498838
        107  |    .072766    .035574     2.05   0.042     .0027521    .1427799
        108  |   .0188628   .0195181     0.97   0.335    -.0195511    .0572767
        109  |   .0171164   .0274109     0.62   0.533    -.0368315    .0710643
        110  |   .0564064   .0319376     1.77   0.078    -.0064508    .1192635
        111  |   .0263564   .0362997     0.73   0.468    -.0450859    .0977987
        112  |   .3467221     .05841     5.94   0.000     .2317642      .46168
        113  |   .7769825   .0374977    20.72   0.000     .7031825    .8507825
        114  |   .0166241   .0353657     0.47   0.639      -.05298    .0862282
        115  |   .0350245   .0290943     1.20   0.230    -.0222366    .0922856
        116  |   .0134288   .0237462     0.57   0.572    -.0333065    .0601642
        117  |   .7836049   .0271719    28.84   0.000     .7301273    .8370825
        118  |   .0603764   .0522496     1.16   0.249    -.0424573      .16321
        119  |    .270404   .0298041     9.07   0.000     .2117459    .3290621
        120  |   .5908429   .0263087    22.46   0.000     .5390643    .6426216
        121  |   .1715044   .0282911     6.06   0.000     .1158241    .2271848
        122  |   .0185886   .0198163     0.94   0.349    -.0204123    .0575896
        123  |   .2189455   .0328565     6.66   0.000     .1542799     .283611
        124  |   .6865653   .0419641    16.36   0.000     .6039748    .7691557
        125  |   .2925436   .0291874    10.02   0.000     .2350993    .3499879
        126  |   .2792494   .0265168    10.53   0.000     .2270612    .3314377
        127  |    .027987   .0252168     1.11   0.268    -.0216427    .0776167
        128  |   .2375539   .0473161     5.02   0.000     .1444301    .3306776
        129  |   .0250624   .0287579     0.87   0.384    -.0315366    .0816615
        130  |   .0248799   .0232469     1.07   0.285    -.0208728    .0706326
        131  |   .0124851   .0412432     0.30   0.762    -.0686865    .0936568
        132  |   .0131774   .0252873     0.52   0.603     -.036591    .0629459
        133  |   .0261656   .0335089     0.78   0.436     -.039784    .0921153
        134  |  -.0247696   .0399063    -0.62   0.535    -.1033101     .053771
        135  |   .3692715   .0359003    10.29   0.000     .2986154    .4399277
        136  |   .0999745   .0330975     3.02   0.003     .0348346    .1651143
        137  |   .0245844   .0295908     0.83   0.407    -.0336538    .0828226
        138  |   .5708033   .0263101    21.70   0.000     .5190219    .6225846
        139  |   .0299862    .030426     0.99   0.325    -.0298958    .0898682
        140  |  -.0074037   .0118614    -0.62   0.533    -.0307484    .0159409
        141  |    .038997   .0232223     1.68   0.094    -.0067073    .0847012
        142  |   -.017141   .0280852    -0.61   0.542    -.0724161     .038134
        143  |   .0297304   .0336503     0.88   0.378    -.0364975    .0959582
        144  |   .0016943   .0249844     0.07   0.946    -.0474779    .0508666
        145  |   .0068322   .0242034     0.28   0.778     -.040803    .0544674
        146  |   .0217532   .0262067     0.83   0.407    -.0298247    .0733312
        147  |  -.0025151   .0340019    -0.07   0.941    -.0694351    .0644048
        148  |   .0580167    .031559     1.84   0.067    -.0040952    .1201286
        149  |  -.0052173   .0339237    -0.15   0.878    -.0719833    .0615486
        150  |  -.0211566   .0396382    -0.53   0.594    -.0991694    .0568562
        151  |   .0035546   .0327592     0.11   0.914    -.0609195    .0680287
        152  |   .1661473   .0284499     5.84   0.000     .1101545    .2221401
        153  |   .3750893   .0174854    21.45   0.000     .3406758    .4095027
        154  |   .3008458   .0294382    10.22   0.000     .2429078    .3587838
        156  |   .0225568   .0264135     0.85   0.394    -.0294282    .0745418
        157  |   .0207165   .0296984     0.70   0.486    -.0377335    .0791666
        158  |    .184517   .0255611     7.22   0.000     .1342095    .2348244
        159  |   .2341965   .0283061     8.27   0.000     .1784868    .2899063
        160  |   .1776186   .0157633    11.27   0.000     .1465945    .2086427
        161  |   .0560461   .0328444     1.71   0.089    -.0085956    .1206878
        162  |   .2553373   .0298075     8.57   0.000     .1966725    .3140021
        163  |   .3752108   .0296231    12.67   0.000     .3169089    .4335126
        164  |   .4929088   .0118448    41.61   0.000     .4695969    .5162207
        165  |   .0458375   .0355376     1.29   0.198    -.0241049    .1157799
        166  |   .0107175   .0324751     0.33   0.742    -.0531974    .0746324
        167  |  -.0131763   .0368725    -0.36   0.721     -.085746    .0593933
        168  |    .060882   .0313564     1.94   0.053    -.0008312    .1225952
        169  |   -.001272   .0387347    -0.03   0.974    -.0775065    .0749626
        170  |   .1951675   .0288626     6.76   0.000     .1383623    .2519727
        171  |   .0780003   .0254567     3.06   0.002     .0278983    .1281022
        172  |   .3728464   .0275009    13.56   0.000     .3187212    .4269716
        173  |   .0330726   .0292598     1.13   0.259    -.0245142    .0906593
        174  |   .5268985   .0356407    14.78   0.000     .4567532    .5970437
        175  |   .0210096   .0348977     0.60   0.548    -.0476733    .0896925
        176  |   .0474331   .0360937     1.31   0.190    -.0236036    .1184698
        177  |   .0145802   .0271946     0.54   0.592    -.0389421    .0681024
        178  |   .0100475   .0278908     0.36   0.719    -.0448449    .0649399
        179  |   .0244067   .0257504     0.95   0.344    -.0262733    .0750867
        180  |   .0480831   .0298411     1.61   0.108    -.0106479    .1068141
        181  |   .0082509   .0290428     0.28   0.777    -.0489089    .0654107
        182  |   .7422826   .0122061    60.81   0.000     .7182595    .7663057
        183  |   .0400594    .029932     1.34   0.182    -.0188503    .0989692
        184  |   .4793843   .0319967    14.98   0.000      .416411    .5423576
        185  |    .217812    .023493     9.27   0.000     .1715748    .2640491
        186  |  -.0254169   .0309476    -0.82   0.412    -.0863256    .0354917
        187  |   .0132068   .0380126     0.35   0.729    -.0616066    .0880202
        188  |   .0131326   .0244599     0.54   0.592    -.0350075    .0612726
        189  |  -.0257295   .0310314    -0.83   0.408     -.086803     .035344
        190  |   .0143926   .0318213     0.45   0.651    -.0482356    .0770209
        191  |   .0162082   .0203986     0.79   0.428    -.0239387    .0563551
        192  |   .0961785   .0400709     2.40   0.017      .017314    .1750429
        193  |   .0475694   .0362361     1.31   0.190    -.0237476    .1188865
        194  |    .326123   .0198228    16.45   0.000     .2871094    .3651366
        195  |  -.0051393   .0205228    -0.25   0.802    -.0455306     .035252
        196  |   .3628381   .0438652     8.27   0.000     .2765061      .44917
        197  |   .0155718    .030383     0.51   0.609    -.0442257    .0753693
        198  |   .0070103   .0382403     0.18   0.855    -.0682512    .0822718
        199  |  -.0423067   .0340705    -1.24   0.215    -.1093616    .0247482
        200  |   .1154944   .0293079     3.94   0.000      .057813    .1731758
        201  |  -.1345663   .0429762    -3.13   0.002    -.2191486   -.0499839
        202  |   .0126107   .0283469     0.44   0.657    -.0431796    .0684009
        203  |   .0929717   .0297851     3.12   0.002     .0343511    .1515924
        204  |  -.0864416   .0374984    -2.31   0.022    -.1602429   -.0126402
        205  |   .2724234   .0262379    10.38   0.000     .2207841    .3240627
        206  |   -.036183   .0345643    -1.05   0.296    -.1042097    .0318437
        207  |   .2926551   .0293495     9.97   0.000     .2348917    .3504184
        208  |   .0705708   .0243128     2.90   0.004     .0227203    .1184213
        209  |  -.0020535   .0283958    -0.07   0.942    -.0579399     .053833
        210  |   .2257984    .056328     4.01   0.000     .1149382    .3366587
        211  |   .0335538   .0283764     1.18   0.238    -.0222944    .0894019
        212  |   .0619597    .022487     2.76   0.006     .0177027    .1062168
        213  |   .0510947   .0324894     1.57   0.117    -.0128484    .1150378
        214  |   .0234482   .0371273     0.63   0.528    -.0496229    .0965193
        215  |   .0233133   .0299254     0.78   0.437    -.0355836    .0822102
        216  |   .0189758   .0271125     0.70   0.485    -.0343848    .0723365
        217  |   .5101837   .0200608    25.43   0.000     .4707017    .5496658
        218  |   .0010112   .0383793     0.03   0.979    -.0745239    .0765462
        219  |  -.0583758   .0595108    -0.98   0.327    -.1755003    .0587488
        220  |   .2398693   .0300862     7.97   0.000      .180656    .2990826
        221  |    .222484   .0355155     6.26   0.000     .1525853    .2923828
        222  |   .0087587   .0244105     0.36   0.720    -.0392841    .0568015
        223  |  -.0083891   .0119063    -0.70   0.482    -.0318221     .015044
        224  |   .1743535   .0369439     4.72   0.000     .1016435    .2470636
        225  |   .3374581   .0302288    11.16   0.000     .2779642     .396952
        226  |   .0983977   .0233042     4.22   0.000     .0525322    .1442633
        227  |   .0687155    .029812     2.30   0.022     .0100419     .127389
        228  |   .5099008   .0263842    19.33   0.000     .4579734    .5618281
        229  |   .0226277   .0399187     0.57   0.571    -.0559371    .1011926
        230  |   .2983618   .0282724    10.55   0.000     .2427182    .3540054
        231  |   .0556012   .0256753     2.17   0.031      .005069    .1061333
        232  |   .0385449   .0194736     1.98   0.049     .0002184    .0768713
        233  |   .3242255   .0420732     7.71   0.000     .2414203    .4070307
        234  |  -.0184854   .0483396    -0.38   0.702    -.1136236    .0766527
        235  |   .0173094   .0248539     0.70   0.487    -.0316061    .0662248
        236  |   .9815146   .0483396    20.30   0.000     .8863764    1.076653
        237  |    .026718   .0371854     0.72   0.473    -.0464674    .0999034
        238  |    .315163   .0403089     7.82   0.000     .2358302    .3944958
        239  |    .306892   .0295009    10.40   0.000     .2488307    .3649533
        240  |   .4983582   .0232762    21.41   0.000     .4525479    .5441686
        241  |   .3117637   .0313202     9.95   0.000     .2501217    .3734058
        242  |   .4931017   .0414962    11.88   0.000     .4114321    .5747713
        243  |   .0128995   .0317487     0.41   0.685    -.0495858    .0753848
        244  |   .2842258   .0335201     8.48   0.000     .2182541    .3501975
        245  |   .0085606   .0572447     0.15   0.881    -.1041039    .1212251
        246  |   .0162739   .0229647     0.71   0.479    -.0289235    .0614713
        247  |   .1026578   .0305228     3.36   0.001     .0425852    .1627304
        248  |   .1888743   .0252216     7.49   0.000     .1392352    .2385134
        249  |    .066985   .0241289     2.78   0.006     .0194965    .1144735
        250  |   .2072416    .030117     6.88   0.000     .1479676    .2665156
        251  |   .0344662   .0251027     1.37   0.171    -.0149389    .0838713
        252  |   .0520835   .0298198     1.75   0.082    -.0066055    .1107724
        253  |  -.0094093   .0327318    -0.29   0.774    -.0738295    .0550108
        254  |   .1412933   .0255408     5.53   0.000     .0910259    .1915607
        255  |   .0041281   .0261473     0.16   0.875    -.0473329    .0555891
        256  |   .0275665   .0266102     1.04   0.301    -.0248056    .0799386
        257  |   .0740586   .0282419     2.62   0.009     .0184752     .129642
        258  |  -.0017382   .0370831    -0.05   0.963    -.0747223    .0712459
        259  |   .0864075   .0220707     3.92   0.000     .0429696    .1298454
        260  |  -.0482969   .0530543    -0.91   0.363    -.1527143    .0561204
        261  |   .1875323   .0416541     4.50   0.000     .1055519    .2695126
        262  |   .0273254   .0259998     1.05   0.294    -.0238454    .0784963
        264  |   .0190384   .0241097     0.79   0.430    -.0284124    .0664891
        265  |   .0089091   .0312374     0.29   0.776    -.0525698     .070388
        266  |  -.0000234   .0237621    -0.00   0.999      -.04679    .0467432
        267  |   .0327173   .0252126     1.30   0.195    -.0169042    .0823388
        268  |  -.0331584   .0306161    -1.08   0.280    -.0934146    .0270978
        269  |  -.0011645   .0393502    -0.03   0.976    -.0786105    .0762815
        270  |   .0140942   .0266867     0.53   0.598    -.0384284    .0666168
        271  |   .1492657   .0298961     4.99   0.000     .0904265    .2081049
        272  |   .0382379    .030142     1.27   0.206    -.0210853     .097561
        273  |    -.07495   .0607324    -1.23   0.218    -.1944787    .0445786
        274  |   .0074856   .0391656     0.19   0.849     -.069597    .0845682
        275  |   .0036079   .0383915     0.09   0.925    -.0719512     .079167
        276  |    .139177   .0304647     4.57   0.000     .0792187    .1991352
        278  |  -.0377515   .0406402    -0.93   0.354    -.1177363    .0422333
        279  |   .1054449   .0205966     5.12   0.000     .0649082    .1459816
        280  |   .8660338   .0489259    17.70   0.000     .7697417    .9623258
        281  |  -.0265746    .024008    -1.11   0.269    -.0738253    .0206761
        282  |   .0472302   .0357575     1.32   0.188    -.0231448    .1176052
        283  |   .1047392   .0341243     3.07   0.002     .0375785    .1718998
        284  |   .4365159   .0296378    14.73   0.000      .378185    .4948467
        285  |   .0458217   .0355804     1.29   0.199    -.0242049    .1158482
        286  |   .1092906   .0317882     3.44   0.001     .0467276    .1718536
        287  |   .8167056   .0370468    22.05   0.000     .7437931    .8896182
        288  |   .2811112    .024641    11.41   0.000     .2326148    .3296076
        289  |   .2328807   .0251031     9.28   0.000     .1834748    .2822865
        290  |   .2764893   .0216375    12.78   0.000     .2339041    .3190745
        291  |   .1793929   .0257658     6.96   0.000     .1286828     .230103
        293  |   .0154945   .0384628     0.40   0.687     -.060205     .091194
        294  |   .7453282    .028573    26.09   0.000      .689093    .8015634
        295  |   .0355298   .0268153     1.32   0.186     -.017246    .0883055
        296  |  -.0099246   .0330287    -0.30   0.764    -.0749291    .0550799
        297  |   .1746098   .0210808     8.28   0.000     .1331203    .2160993
             |
       _cons |  -.0227316   .0359533    -0.63   0.528     -.093492    .0480288
------------------------------------------------------------------------------

. estimates store model_1

. // second, regress posresponse on all variables, condition BOX==1 specified
. // store regression result
. reg posresponse white crime ged empgap i.center i.chain_id if box == 1, cluster(chain_id)

Linear regression                               Number of obs     =      2,918
                                                F(70, 94)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1860
                                                Root MSE          =     .28792

                              (Std. Err. adjusted for 95 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
 posresponse |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       white |  -.0008679   .0093741    -0.09   0.926    -.0194804    .0177446
       crime |  -.0520298   .0122924    -4.23   0.000    -.0764367   -.0276229
         ged |    .010484    .013369     0.78   0.435    -.0160604    .0370285
      empgap |   .0102777   .0100392     1.02   0.309    -.0096553    .0302106
             |
      center |
          2  |   .0740363   .0912649     0.81   0.419    -.1071723     .255245
          3  |   .1204133   .0643846     1.87   0.065    -.0074239    .2482506
          4  |   .0794403   .0648705     1.22   0.224    -.0493616    .2082421
          5  |  -.0366967   .0411881    -0.89   0.375    -.1184765    .0450832
          6  |   .0071232   .0666603     0.11   0.915    -.1252325    .1394788
          7  |  -.0254758   .0620585    -0.41   0.682    -.1486944    .0977428
          8  |  -.0362179   .0542419    -0.67   0.506    -.1439165    .0714807
          9  |   -.023277   .0467988    -0.50   0.620    -.1161971    .0696432
         10  |   .0116273   .0488116     0.24   0.812    -.0852893    .1085438
         11  |   .1110431    .063618     1.75   0.084    -.0152719    .2373582
         12  |   .0431607   .0791821     0.55   0.587    -.1140571    .2003785
         13  |   .0570355   .0820274     0.70   0.489    -.1058318    .2199028
         14  |  -.0100753   .0661038    -0.15   0.879     -.141326    .1211754
         15  |   .0210969   .0481866     0.44   0.663    -.0745787    .1167726
         16  |   .0332766   .0679002     0.49   0.625    -.1015409     .168094
         17  |   .0255698   .0536217     0.48   0.635    -.0808974     .132037
         18  |   -.038654   .1009163    -0.38   0.703    -.2390257    .1617178
         19  |   .0125749   .0512097     0.25   0.807     -.089103    .1142529
         20  |  -.0226874   .0440705    -0.51   0.608    -.1101905    .0648157
         21  |   .1149879   .1027307     1.12   0.266    -.0889864    .3189621
         22  |  -.0280812    .039986    -0.70   0.484    -.1074743    .0513119
         23  |   .0042334   .0385143     0.11   0.913    -.0722377    .0807044
         24  |   .0107303   .0594053     0.18   0.857    -.1072203    .1286809
         25  |   .0602341   .0816456     0.74   0.463    -.1018752    .2223433
         26  |   .2205723   .0743695     2.97   0.004     .0729099    .3682347
         27  |   .0421588   .0679767     0.62   0.537    -.0928106    .1771282
         28  |   .1371798   .0801418     1.71   0.090    -.0219436    .2963032
         29  |  -.0305534   .0524639    -0.58   0.562    -.1347216    .0736148
         30  |  -.0500323   .0448814    -1.11   0.268    -.1391453    .0390806
         31  |  -.0085455   .0445388    -0.19   0.848    -.0969782    .0798873
         32  |   .1343904   .0872316     1.54   0.127      -.03881    .3075907
         33  |   .0310742   .0921667     0.34   0.737     -.151925    .2140734
         34  |   -.025081   .0389085    -0.64   0.521    -.1023347    .0521726
         35  |   .0263304     .05994     0.44   0.661    -.0926819    .1453427
         36  |   .0194204   .0536084     0.36   0.718    -.0870203    .1258611
         37  |   .0987267   .1160671     0.85   0.397    -.1317272    .3291806
         38  |   .1302673   .0783856     1.66   0.100    -.0253692    .2859037
         39  |   .0650379   .0907768     0.72   0.475    -.1152015    .2452774
         40  |    .061113   .0803186     0.76   0.449    -.0983614    .2205874
         41  |  -.0014601    .050877    -0.03   0.977    -.1024776    .0995574
         42  |  -.0048178   .0691064    -0.07   0.945    -.1420301    .1323945
         43  |   .1333176   .0965263     1.38   0.171    -.0583376    .3249728
         44  |   .0809718   .0909025     0.89   0.375    -.0995172    .2614609
        101  |   .0849349   .0697687     1.22   0.227    -.0535924    .2234622
        102  |   .1561042   .1324246     1.18   0.241     -.106828    .4190363
        103  |  -.1255076   .0560879    -2.24   0.028    -.2368714   -.0141438
        104  |   .0479806    .061668     0.78   0.438    -.0744626    .1704238
        105  |   .0949966    .082704     1.15   0.254    -.0692142    .2592074
        106  |   .0702155   .0618361     1.14   0.259    -.0525616    .1929926
        107  |  -.0145873   .0603136    -0.24   0.809    -.1343413    .1051668
        108  |   .1235161   .0989842     1.25   0.215    -.0730192    .3200515
        109  |   .2113623   .1318882     1.60   0.112    -.0505049    .4732295
        110  |   .0070819    .062503     0.11   0.910    -.1170193    .1311832
        111  |  -.0107301   .0720244    -0.15   0.882    -.1537362     .132276
        112  |   .2080551   .1949613     1.07   0.289    -.1790452    .5951554
        113  |   .1009159   .0827781     1.22   0.226     -.063442    .2652737
        114  |   .0505486   .1048575     0.48   0.631    -.1576485    .2587456
        115  |  -.0413752   .0431374    -0.96   0.340    -.1270256    .0442751
        116  |   .0636599   .0699329     0.91   0.365    -.0751935    .2025133
        117  |   .1215168    .065204     1.86   0.065    -.0079472    .2509808
        118  |   .0843945     .11333     0.74   0.458    -.1406249     .309414
        119  |   .1368713   .0807847     1.69   0.094    -.0235287    .2972712
        120  |   .2037048    .090811     2.24   0.027     .0233974    .3840121
        121  |  -.0317945   .0619921    -0.51   0.609    -.1548813    .0912923
        122  |   .0258454   .0571219     0.45   0.652    -.0875715    .1392622
        123  |   .1319082   .0464982     2.84   0.006      .039585    .2242314
        124  |   .0738325   .1223265     0.60   0.548    -.1690496    .3167146
        125  |  -.0327299   .0834656    -0.39   0.696    -.1984527     .132993
        126  |   .1341638   .0936479     1.43   0.155    -.0517762    .3201038
        127  |  -.0385125   .0449272    -0.86   0.394    -.1277164    .0506914
        128  |   .1089279   .2699345     0.40   0.687    -.4270333    .6448892
        129  |   .1309039   .0626117     2.09   0.039     .0065868    .2552209
        130  |   .0231372   .0714811     0.32   0.747    -.1187903    .1650646
        131  |    .123249   .1292793     0.95   0.343    -.1334381    .3799362
        132  |   .2404798   .2020923     1.19   0.237    -.1607792    .6417389
        133  |  -.0456965   .0635149    -0.72   0.474    -.1718069    .0804138
        134  |   .0372173   .1073441     0.35   0.730    -.1759169    .2503515
        135  |   .0138057   .0602804     0.23   0.819    -.1058824    .1334938
        136  |   .1037322   .1226415     0.85   0.400    -.1397752    .3472397
        137  |   .0480437   .0910409     0.53   0.599    -.1327201    .2288075
        138  |   -.042974    .058964    -0.73   0.468    -.1600485    .0741005
        139  |  -.1005371   .0571299    -1.76   0.082    -.2139699    .0128957
        140  |  -.0349012   .0449559    -0.78   0.439    -.1241622    .0543598
             |
    chain_id |
         13  |   .0013944   .0233618     0.06   0.953    -.0449911    .0477798
         20  |  -.0072764   .0454589    -0.16   0.873    -.0975362    .0829834
         22  |   .0110744   .0430015     0.26   0.797    -.0743061    .0964549
         34  |    .014071   .0492533     0.29   0.776    -.0837225    .1118645
         36  |  -.0144134   .0299519    -0.48   0.631    -.0738836    .0450568
         43  |  -.0019501   .0712873    -0.03   0.978    -.1434926    .1395925
         46  |   .1421654   .0335239     4.24   0.000      .075603    .2087278
         47  |  -.0849174   .0750236    -1.13   0.261    -.2338784    .0640437
         54  |  -.0073429   .0341485    -0.22   0.830    -.0751457    .0604598
         55  |  -.0651936   .0888277    -0.73   0.465    -.2415632     .111176
         57  |  -.0696028   .0653544    -1.07   0.290    -.1993654    .0601599
         65  |  -.0393817   .0685171    -0.57   0.567    -.1754239    .0966606
         70  |   .0125561   .0557444     0.23   0.822    -.0981258     .123238
         74  |     .13427   .0322447     4.16   0.000     .0702474    .1982927
         75  |   .1228783   .0398227     3.09   0.003     .0438094    .2019473
         77  |   -.022246   .0568997    -0.39   0.697    -.1352217    .0907298
         78  |   .2996305   .0594113     5.04   0.000      .181668    .4175931
         79  |  -.1270709    .070016    -1.81   0.073    -.2660894    .0119475
         90  |   .7092665   .0434638    16.32   0.000      .622968     .795565
         96  |  -.0201183   .0301151    -0.67   0.506    -.0799126     .039676
         97  |  -.0042003   .0448027    -0.09   0.926     -.093157    .0847565
        101  |   .0020465   .0352218     0.06   0.954    -.0678872    .0719801
        102  |  -.0151315   .0429249    -0.35   0.725    -.1003598    .0700968
        103  |  -.0198397   .0211809    -0.94   0.351    -.0618948    .0222155
        107  |   .0499681   .0588884     0.85   0.398    -.0669562    .1668924
        109  |  -.0220546   .0265367    -0.83   0.408    -.0747439    .0306346
        112  |   .3082757   .1258399     2.45   0.016     .0584178    .5581337
        116  |   .0345574   .0209576     1.65   0.103    -.0070544    .0761692
        120  |   .5818798   .0360287    16.15   0.000     .5103439    .6534157
        121  |    .087901   .0362235     2.43   0.017     .0159783    .1598237
        127  |  -.0100639   .0292374    -0.34   0.731    -.0681154    .0479876
        136  |   .2610744   .0430015     6.07   0.000     .1756939    .3464549
        137  |   .0045344   .0676908     0.07   0.947    -.1298672     .138936
        138  |   .5606586   .0383077    14.64   0.000     .4845978    .6367194
        141  |   -.011707   .0312897    -0.37   0.709    -.0738334    .0504193
        142  |   .0255807   .0349258     0.73   0.466    -.0437652    .0949266
        143  |   .0206467   .0495451     0.42   0.678    -.0777263    .1190197
        144  |   .0381093   .0273512     1.39   0.167    -.0161971    .0924158
        145  |   .0051693   .0262223     0.20   0.844    -.0468957    .0572343
        146  |  -.0206801   .0352411    -0.59   0.559    -.0906522     .049292
        147  |  -.0414206   .0607431    -0.68   0.497    -.1620274    .0791862
        148  |   .0245745   .0525069     0.47   0.641    -.0796792    .1288282
        149  |  -.0629242   .0826645    -0.76   0.448    -.2270566    .1012082
        150  |  -.0827533   .1016424    -0.81   0.418    -.2845667    .1190601
        151  |   .0893571   .0481977     1.85   0.067    -.0063406    .1850547
        153  |   .3230251   .0410139     7.88   0.000      .241591    .4044592
        154  |   .1683763   .0385927     4.36   0.000     .0917497     .245003
        156  |   -.023471   .0437893    -0.54   0.593    -.1104156    .0634736
        158  |    .322067   .1900833     1.69   0.094    -.0553479    .6994819
        160  |   .0197373   .0217035     0.91   0.365    -.0233555      .06283
        161  |   .0453362   .0595887     0.76   0.449    -.0729785     .163651
        162  |   .1539879   .0447861     3.44   0.001     .0650641    .2429117
        163  |   .3715854   .0366164    10.15   0.000     .2988827     .444288
        168  |   .0634714    .047207     1.34   0.182    -.0302592    .1572019
        171  |   .0596385   .0304476     1.96   0.053    -.0008158    .1200929
        179  |   .0002664   .0367015     0.01   0.994    -.0726052     .073138
        181  |   .0346633   .0541085     0.64   0.523    -.0727704    .1420969
        182  |   .9774793   .0133472    73.23   0.000     .9509781     1.00398
        185  |   .1634646   .0281466     5.81   0.000     .1075788    .2193504
        187  |  -.1408849   .0916108    -1.54   0.127    -.3227802    .0410105
        194  |   .3203949   .0344202     9.31   0.000     .2520528     .388737
        196  |   .3965972   .0369265    10.74   0.000     .3232787    .4699157
        199  |  -.0476708   .0385973    -1.24   0.220    -.1243066     .028965
        200  |   .0671052   .0396924     1.69   0.094     -.011705    .1459154
        203  |    .251379    .039872     6.30   0.000     .1722123    .3305457
        204  |  -.0732505   .0444769    -1.65   0.103    -.1615604    .0150594
        205  |   .4323152   .0401837    10.76   0.000     .3525296    .5121008
        208  |   .0358167   .0426573     0.84   0.403    -.0488804    .1205137
        209  |   -.051809   .0296664    -1.75   0.084    -.1107123    .0070942
        210  |   .5523679   .0803226     6.88   0.000     .3928855    .7118504
        212  |   .0477289   .0318579     1.50   0.137    -.0155257    .1109836
        215  |    .019924   .0859557     0.23   0.817     -.150743     .190591
        220  |    .249977   .0459583     5.44   0.000     .1587258    .3412283
        223  |  -.0171755   .0147201    -1.17   0.246    -.0464026    .0120516
        225  |   .2906447   .0292992     9.92   0.000     .2324705    .3488189
        227  |   .0558377    .040448     1.38   0.171    -.0244728    .1361482
        229  |  -.0515054   .1271951    -0.40   0.686    -.3040542    .2010434
        230  |   .2862105   .0315794     9.06   0.000     .2235088    .3489122
        232  |   .0218294   .0274183     0.80   0.428    -.0326103    .0762692
        236  |   .9658389   .1041855     9.27   0.000     .7589761    1.172702
        239  |   .1556413   .0480849     3.24   0.002     .0601675    .2511151
        241  |   .2617817    .041233     6.35   0.000     .1799126    .3436509
        242  |   -.167107   .1889322    -0.88   0.379    -.5422364    .2080224
        246  |     .02362   .0396544     0.60   0.553    -.0551149    .1023548
        247  |  -.0055914   .0443264    -0.13   0.900    -.0936025    .0824197
        252  |   .0837862   .0399574     2.10   0.039     .0044498    .1631226
        255  |   .0078486    .035945     0.22   0.828    -.0635211    .0792182
        259  |   .2035149   .0303509     6.71   0.000     .1432525    .2637773
        260  |  -.0257179   .0791599    -0.32   0.746    -.1828917    .1314559
        269  |  -.2181022   .0854085    -2.55   0.012    -.3876829   -.0485215
        270  |  -.0059887   .0409865    -0.15   0.884    -.0873683     .075391
        289  |   .2060008   .0378571     5.44   0.000     .1308345     .281167
        291  |   .0245447   .0456611     0.54   0.592    -.0661164    .1152059
        297  |   .1294929    .030444     4.25   0.000     .0690456    .1899401
             |
       _cons |  -.0088121   .0668267    -0.13   0.895     -.141498    .1238738
------------------------------------------------------------------------------

. estimates store model_2

. // finally, establish table using model_1 and model_2
. esttab model_1 model_2 using "result_d", ///
> rtf replace se ///
> stats(N, labels("N")) ///
> drop(_cons *.center *.chain_id)
(output written to result_d.rtf)

. 
. 
. //Question (e)
. // first, regress interview on all variables
. // store regression result
. reg interview white crime ged empgap pre i.center i.chain_id, cluster(chain_id)

Linear regression                               Number of obs     =     14,637
                                                F(87, 292)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1475
                                                Root MSE          =     .22798

                             (Std. Err. adjusted for 293 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
   interview |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       white |   .0135287   .0047092     2.87   0.004     .0042603     .022797
       crime |   -.009313   .0045772    -2.03   0.043    -.0183215   -.0003045
         ged |  -.0023934   .0033934    -0.71   0.481     -.009072    .0042851
      empgap |   -.003051   .0028703    -1.06   0.289       -.0087    .0025981
         pre |  -.0071522   .0091821    -0.78   0.437    -.0252238    .0109194
             |
      center |
          2  |    .016928   .0319762     0.53   0.597    -.0460052    .0798611
          3  |   .0267969      .0283     0.95   0.344    -.0289008    .0824947
          4  |   .0180521   .0221313     0.82   0.415     -.025505    .0616091
          5  |  -.0034536   .0196942    -0.18   0.861    -.0422141    .0353069
          6  |   .0082435   .0252809     0.33   0.745    -.0415124    .0579994
          7  |  -.0104647   .0197815    -0.53   0.597    -.0493972    .0284677
          8  |   .0131584   .0231847     0.57   0.571    -.0324718    .0587886
          9  |   .0187437   .0271881     0.69   0.491    -.0347658    .0722533
         10  |   .0126099   .0215975     0.58   0.560    -.0298966    .0551165
         11  |   .0297696   .0274807     1.08   0.280    -.0243158    .0838551
         12  |   .0223474   .0280996     0.80   0.427    -.0329561    .0776509
         13  |   .0128883   .0271726     0.47   0.636    -.0405907    .0663673
         14  |  -.0119253   .0190953    -0.62   0.533    -.0495071    .0256565
         15  |   .0292287   .0261246     1.12   0.264    -.0221877    .0806451
         16  |   .0046774   .0201597     0.23   0.817    -.0349992    .0443541
         17  |   .0280836   .0277632     1.01   0.313    -.0265577    .0827249
         18  |   .0096357   .0288929     0.33   0.739    -.0472291    .0665005
         19  |  -.0070747   .0186411    -0.38   0.705    -.0437626    .0296131
         20  |  -.0117582   .0157006    -0.75   0.455    -.0426589    .0191425
         21  |   .0371643   .0384012     0.97   0.334     -.038414    .1127426
         22  |   .0305159   .0244007     1.25   0.212    -.0175077    .0785395
         23  |   .0030796   .0191307     0.16   0.872    -.0345719    .0407311
         24  |  -.0048247   .0261155    -0.18   0.854    -.0562231    .0465738
         25  |   .0295863   .0278254     1.06   0.289    -.0251774    .0843501
         26  |   .0428728   .0361635     1.19   0.237    -.0283014    .1140469
         27  |   .0374844   .0317062     1.18   0.238    -.0249173    .0998861
         28  |    .036781   .0309028     1.19   0.235    -.0240395    .0976015
         29  |   .0350614   .0380328     0.92   0.357    -.0397918    .1099146
         30  |  -.0174889   .0185236    -0.94   0.346    -.0539457    .0189678
         31  |     .04138   .0312192     1.33   0.186    -.0200632    .1028233
         32  |   .0241414   .0257523     0.94   0.349    -.0265422     .074825
         33  |  -.0102106   .0213116    -0.48   0.632    -.0521543    .0317331
         34  |  -.0003787   .0211659    -0.02   0.986    -.0420358    .0412784
         35  |   .0100451   .0205269     0.49   0.625    -.0303543    .0504445
         36  |   .0393455   .0322086     1.22   0.223    -.0240448    .1027359
         37  |   .0519649   .0319111     1.63   0.105      -.01084    .1147698
         38  |   -.000974   .0268514    -0.04   0.971    -.0538208    .0518727
         39  |   .0200776   .0230023     0.87   0.383    -.0251938     .065349
         40  |   .0619609   .0357393     1.73   0.084    -.0083785    .1323002
         41  |   .0201233   .0271741     0.74   0.460    -.0333586    .0736052
         42  |   .0036856   .0263103     0.14   0.889    -.0480962    .0554674
         43  |   .0240234   .0268868     0.89   0.372    -.0288932    .0769399
         44  |   .0293747   .0317324     0.93   0.355    -.0330786     .091828
        101  |   .0558433   .0279998     1.99   0.047     .0007362    .1109503
        102  |    .040467   .0405505     1.00   0.319    -.0393412    .1202752
        103  |   .0033511    .038276     0.09   0.930    -.0719807    .0786829
        104  |   .0342025   .0253326     1.35   0.178    -.0156551      .08406
        105  |   .0377137   .0281302     1.34   0.181    -.0176499    .0930773
        106  |   .0853528    .026293     3.25   0.001     .0336049    .1371007
        107  |   .0453698   .0285774     1.59   0.113     -.010874    .1016137
        108  |   .0579684   .0381968     1.52   0.130    -.0172075    .1331443
        109  |   .0908734    .055289     1.64   0.101    -.0179421     .199689
        110  |   .0047236   .0208749     0.23   0.821    -.0363607    .0458079
        111  |  -.0046629   .0243071    -0.19   0.848    -.0525021    .0431764
        112  |   .0560473   .0262237     2.14   0.033     .0044359    .1076588
        113  |   .0547956   .0563086     0.97   0.331    -.0560265    .1656177
        114  |   .0140043   .0251626     0.56   0.578    -.0355187    .0635273
        115  |   .0405541   .0493549     0.82   0.412    -.0565823    .1376905
        116  |   .0676706   .0285015     2.37   0.018     .0115762    .1237649
        117  |   .0571537   .0284953     2.01   0.046     .0010715    .1132358
        118  |   .0362672   .0401728     0.90   0.367    -.0427976    .1153321
        119  |   .0353809   .0331912     1.07   0.287    -.0299435    .1007053
        120  |    .067999   .0334966     2.03   0.043     .0020736    .1339244
        121  |  -.0005259   .0209505    -0.03   0.980     -.041759    .0407073
        122  |   .0471421   .0319276     1.48   0.141    -.0156952    .1099795
        123  |   .0352722   .0298921     1.18   0.239    -.0235591    .0941035
        124  |   .0407864   .0318811     1.28   0.202    -.0219595    .1035323
        125  |   .0480646     .03061     1.57   0.117    -.0121797    .1083089
        126  |   .0825038   .0586343     1.41   0.160    -.0328957    .1979032
        127  |   .0469749   .0310417     1.51   0.131     -.014119    .1080688
        128  |  -.0004862   .0298017    -0.02   0.987    -.0591395    .0581672
        129  |   .1032741   .0431645     2.39   0.017     .0183211     .188227
        130  |   .0179695    .030879     0.58   0.561    -.0428041     .078743
        131  |   .0248719   .0287248     0.87   0.387    -.0316621    .0814059
        132  |   .0807407   .0477684     1.69   0.092    -.0132733    .1747547
        133  |   .0065753    .028013     0.23   0.815    -.0485577    .0617084
        134  |   .0149842   .0301429     0.50   0.619    -.0443408    .0743091
        135  |   .0511214   .0323553     1.58   0.115    -.0125578    .1148006
        136  |   .0533853   .0389086     1.37   0.171    -.0231915    .1299621
        137  |  -.0204542   .0362818    -0.56   0.573    -.0918613    .0509529
        138  |   .0196689   .0249929     0.79   0.432    -.0295201    .0688579
        139  |   .0720201   .0316442     2.28   0.024     .0097406    .1342997
        140  |    .098724   .0394392     2.50   0.013     .0211028    .1763452
             |
    chain_id |
          2  |   .0247378    .029812     0.83   0.407    -.0339358    .0834113
          3  |   .0100308   .0216833     0.46   0.644    -.0326447    .0527062
          4  |   .0349885   .0261215     1.34   0.181    -.0164218    .0863989
          5  |   .0766825   .0251502     3.05   0.003     .0271838    .1261812
          6  |    .111193   .0240265     4.63   0.000     .0639059      .15848
          7  |   .5504846   .0287381    19.16   0.000     .4939246    .6070446
          8  |   .0395066   .0340092     1.16   0.246    -.0274276    .1064408
          9  |    .024731   .0268512     0.92   0.358    -.0281154    .0775774
         10  |   .2666129    .031177     8.55   0.000     .2052528    .3279731
         11  |    .119227   .0277553     4.30   0.000     .0646013    .1738528
         12  |   .3818092   .0234678    16.27   0.000     .3356218    .4279966
         13  |    .009446   .0132623     0.71   0.477    -.0166559    .0355478
         14  |   .0175843    .012837     1.37   0.172    -.0076804     .042849
         15  |  -.0328305   .0348139    -0.94   0.346    -.1013486    .0356875
         16  |   .2686265   .0215132    12.49   0.000      .226286    .3109671
         17  |   .9151062   .0204401    44.77   0.000     .8748777    .9553347
         18  |   .0241727   .0272328     0.89   0.375    -.0294247      .07777
         19  |    .029966   .0233134     1.29   0.200    -.0159176    .0758495
         20  |    .027754   .0248781     1.12   0.266    -.0212091     .076717
         21  |    .049117    .026105     1.88   0.061    -.0022608    .1004948
         22  |  -.0135761   .0238225    -0.57   0.569    -.0604617    .0333096
         23  |   .1865635   .0189388     9.85   0.000     .1492897    .2238374
         24  |  -.0347817   .0354252    -0.98   0.327    -.1045028    .0349393
         25  |  -.0005968   .0227881    -0.03   0.979    -.0454466    .0442529
         26  |   .2507012   .0197035    12.72   0.000     .2119222    .2894801
         27  |   .0161651   .0162704     0.99   0.321    -.0158571    .0481873
         28  |   .2076586   .0240045     8.65   0.000     .1604149    .2549023
         29  |    .032463   .0177585     1.83   0.069    -.0024879    .0674138
         30  |   .0316301   .0272223     1.16   0.246    -.0219467    .0852068
         31  |   .1047959   .0216541     4.84   0.000     .0621779    .1474139
         32  |  -.0135761   .0238225    -0.57   0.569    -.0604617    .0333096
         33  |    .033174   .0231525     1.43   0.153    -.0123929    .0787409
         34  |  -.0050061   .0270854    -0.18   0.853    -.0583135    .0483013
         35  |   .0132792   .0152871     0.87   0.386    -.0168077    .0433661
         36  |    .015968    .016298     0.98   0.328    -.0161084    .0480444
         37  |  -.0089984   .0425306    -0.21   0.833    -.0927038    .0747069
         38  |    .011298   .0228954     0.49   0.622     -.033763     .056359
         39  |   .0226313   .0296418     0.76   0.446    -.0357074    .0809701
         40  |   .0113474   .0237711     0.48   0.633    -.0354369    .0581317
         41  |   .5175864   .0209074    24.76   0.000     .4764381    .5587348
         42  |   .0118673   .0234474     0.51   0.613    -.0342801    .0580146
         43  |   -.028191   .0359351    -0.78   0.433    -.0989157    .0425338
         44  |   .0345744   .0240509     1.44   0.152    -.0127607    .0819095
         45  |   .0250826   .0216204     1.16   0.247     -.017469    .0676343
         46  |   .0974677   .0239156     4.08   0.000     .0503988    .1445366
         47  |  -.0009801   .0307513    -0.03   0.975    -.0615024    .0595423
         48  |   .0419261   .0278738     1.50   0.134    -.0129329     .096785
         49  |   .0889276   .0165551     5.37   0.000     .0563451      .12151
         50  |   .0258962    .019087     1.36   0.176    -.0116692    .0634617
         51  |   .5132718   .0224866    22.83   0.000     .4690155    .5575281
         52  |  -.0055319   .0322666    -0.17   0.864    -.0690365    .0579728
         53  |   .0458462   .0288086     1.59   0.113    -.0108527     .102545
         54  |   .0226437   .0177668     1.27   0.204    -.0123236    .0576109
         55  |  -.0167725    .038454    -0.44   0.663    -.0924546    .0589097
         56  |   .2069621   .0219704     9.42   0.000     .1637217    .2502025
         57  |  -.0154965   .0149672    -1.04   0.301    -.0449538    .0139608
         58  |   .2205623   .0178021    12.39   0.000     .1855255     .255599
         59  |   .3545899   .0183768    19.30   0.000     .3184222    .3907576
         60  |   .0232176    .017482     1.33   0.185     -.011189    .0576243
         61  |   .2669391   .0284226     9.39   0.000     .2109999    .3228782
         62  |   .0187722   .0191484     0.98   0.328    -.0189141    .0564586
         63  |  -.0001454   .0244289    -0.01   0.995    -.0482244    .0479337
         64  |  -.0166332   .0248376    -0.67   0.504    -.0655167    .0322502
         65  |   .0048826    .021398     0.23   0.820    -.0372313    .0469964
         66  |    .023959   .0299301     0.80   0.424     -.034947    .0828651
         67  |  -.0651304   .0465761    -1.40   0.163    -.1567977     .026537
         68  |   .0191519   .0209151     0.92   0.361    -.0220115    .0603154
         69  |   .0241394   .0299897     0.80   0.422     -.034884    .0831628
         70  |   .0387281   .0265811     1.46   0.146    -.0135868     .091043
         71  |   .3721811   .0210694    17.66   0.000      .330714    .4136481
         72  |  -.0304537   .0284058    -1.07   0.285    -.0863597    .0254523
         73  |   .2525449   .0298497     8.46   0.000     .1937971    .3112927
         74  |   .1246651   .0218946     5.69   0.000     .0815739    .1677563
         75  |   .1384943   .0214612     6.45   0.000      .096256    .1807326
         76  |  -.0079155    .043149    -0.18   0.855     -.092838    .0770069
         77  |   .0420678   .0213716     1.97   0.050     5.78e-06    .0841297
         78  |   .0249729   .0268522     0.93   0.353    -.0278755    .0778212
         79  |   -.013451   .0260898    -0.52   0.607    -.0647988    .0378968
         80  |   .0477893   .0219434     2.18   0.030     .0046019    .0909766
         81  |  -.0135761   .0238225    -0.57   0.569    -.0604617    .0333096
         82  |   .0624408    .022017     2.84   0.005     .0191087    .1057729
         83  |   .5081006   .0298608    17.02   0.000      .449331    .5668703
         84  |   .0251984   .0258281     0.98   0.330    -.0256344    .0760312
         85  |   -.002375   .0236355    -0.10   0.920    -.0488924    .0441425
         86  |   .0110972   .0156926     0.71   0.480    -.0197876    .0419821
         87  |   .0402523   .0202987     1.98   0.048      .000302    .0802025
         88  |   .0068589   .0199407     0.34   0.731    -.0323867    .0461045
         89  |   .0105777   .0230669     0.46   0.647    -.0348208    .0559763
         90  |   .7327765   .0246127    29.77   0.000     .6843357    .7812173
         91  |   .0102509   .0193554     0.53   0.597    -.0278428    .0483446
         92  |   .3278533   .0266463    12.30   0.000     .2754101    .3802966
         93  |   .0321051   .0232133     1.38   0.168    -.0135814    .0777917
         94  |   .5137758   .0189445    27.12   0.000     .4764908    .5510609
         95  |   .4976908   .0245191    20.30   0.000     .4494342    .5459473
         96  |   .0202337   .0198442     1.02   0.309     -.018822    .0592894
         97  |   .2587617   .0209143    12.37   0.000     .2175999    .2999236
         98  |  -.0298553   .0280343    -1.06   0.288    -.0850303    .0253196
         99  |   .0394973   .0226159     1.75   0.082    -.0050134    .0840081
        100  |    .071501   .0198841     3.60   0.000     .0323666    .1106353
        101  |   .0204611   .0189397     1.08   0.281    -.0168145    .0577368
        102  |   .1776803   .0289539     6.14   0.000     .1206954    .2346651
        103  |   .0160102    .011997     1.33   0.183    -.0076013    .0396217
        104  |   .0118389    .018679     0.63   0.527    -.0249237    .0486015
        105  |  -.0047291   .0315553    -0.15   0.881    -.0668337    .0573755
        106  |  -.0182979   .0382604    -0.48   0.633     -.093599    .0570031
        107  |   .0569063   .0311105     1.83   0.068    -.0043228    .1181355
        108  |   .0104805   .0182375     0.57   0.566    -.0254132    .0463741
        109  |   .0216745   .0200352     1.08   0.280    -.0177572    .0611062
        110  |   .0502334   .0255555     1.97   0.050     -.000063    .1005297
        111  |   .0221644   .0308148     0.72   0.473    -.0384829    .0828118
        112  |  -.0521314   .0500741    -1.04   0.299    -.1506832    .0464204
        113  |    .023296   .0315592     0.74   0.461    -.0388164    .0854083
        114  |  -.0028537   .0261099    -0.11   0.913     -.054241    .0485337
        115  |   .0234581   .0227559     1.03   0.303    -.0213282    .0682444
        116  |   .0001477    .020314     0.01   0.994    -.0398327    .0401281
        117  |   .2804099    .022342    12.55   0.000     .2364381    .3243818
        118  |   .0347926   .0447208     0.78   0.437    -.0532234    .1228086
        119  |   .2977559   .0261946    11.37   0.000     .2462018      .34931
        120  |   .5339042   .0212867    25.08   0.000     .4920093    .5757991
        121  |   .0928853   .0245087     3.79   0.000     .0446493    .1411213
        122  |   .0143727   .0139642     1.03   0.304    -.0131106     .041856
        123  |   .1287504   .0275038     4.68   0.000     .0746196    .1828811
        124  |   -.010328   .0341607    -0.30   0.763    -.0775604    .0569044
        125  |   .1472746   .0239503     6.15   0.000     .1001375    .1944117
        126  |   .0371613   .0199549     1.86   0.064    -.0021125     .076435
        127  |    .027035   .0200427     1.35   0.178    -.0124114    .0664814
        128  |   .0241394   .0299897     0.80   0.422     -.034884    .0831628
        129  |   .0306445   .0217932     1.41   0.161    -.0122473    .0735362
        130  |   .0260394   .0155312     1.68   0.095    -.0045278    .0566066
        131  |  -.0159451   .0331762    -0.48   0.631    -.0812399    .0493498
        132  |   .0047167   .0203824     0.23   0.817    -.0353983    .0448317
        133  |   .0210374   .0267731     0.79   0.433    -.0316552    .0737301
        134  |    .036014   .0333836     1.08   0.282    -.0296889     .101717
        135  |   .0434517    .031478     1.38   0.169    -.0185009    .1054043
        136  |  -.0166374   .0227885    -0.73   0.466     -.061488    .0282132
        137  |   .0134597   .0233207     0.58   0.564    -.0324382    .0593576
        138  |   .5762479   .0195537    29.47   0.000     .5377639    .6147319
        139  |   .0025238   .0231953     0.11   0.913    -.0431274     .048175
        140  |   .0015864   .0106717     0.15   0.882    -.0194168    .0225896
        141  |   .0271734   .0184907     1.47   0.143    -.0092185    .0635653
        142  |   .0063725   .0238971     0.27   0.790    -.0406598    .0534049
        143  |   .0331046   .0250317     1.32   0.187    -.0161607      .08237
        144  |   .0074485   .0207192     0.36   0.719    -.0333294    .0482263
        145  |   .0239252   .0138979     1.72   0.086    -.0034276     .051278
        146  |    .016125   .0194781     0.83   0.408    -.0222103    .0544603
        147  |  -.0093051   .0287339    -0.32   0.746    -.0658569    .0472467
        148  |    .050069   .0253057     1.98   0.049     .0002643    .0998737
        149  |   .0195717   .0272162     0.72   0.473     -.033993    .0731364
        150  |   .0131421   .0307793     0.43   0.670    -.0474352    .0737195
        151  |   .0087593   .0260387     0.34   0.737     -.042488    .0600066
        152  |   .0667225   .0243722     2.74   0.007      .018755      .11469
        153  |   .1424201   .0179103     7.95   0.000     .1071705    .1776697
        154  |   .2971002   .0273985    10.84   0.000     .2431766    .3510238
        156  |   .0165591   .0159797     1.04   0.301    -.0148909     .048009
        157  |   .0469932    .026121     1.80   0.073    -.0044161    .0984025
        158  |   .2011224    .018536    10.85   0.000     .1646413    .2376035
        159  |   .2577757   .0228904    11.26   0.000     .2127245    .3028268
        160  |    .054536   .0126517     4.31   0.000     .0296359    .0794361
        161  |   .0473468     .02584     1.83   0.068    -.0035095    .0982031
        162  |   .1025413   .0255735     4.01   0.000     .0522096     .152873
        163  |   .3131267   .0223719    14.00   0.000     .2690961    .3571573
        164  |   .0008237   .0105781     0.08   0.938    -.0199953    .0216427
        165  |   .0480971    .025337     1.90   0.059    -.0017691    .0979633
        166  |   .0204966   .0196839     1.04   0.299    -.0182437     .059237
        167  |   .0172781   .0277337     0.62   0.534    -.0373052    .0718613
        168  |  -.0076654   .0248699    -0.31   0.758    -.0566124    .0412816
        169  |  -.0023412   .0310168    -0.08   0.940     -.063386    .0587036
        170  |   .1019929   .0221908     4.60   0.000     .0583187    .1456671
        171  |   .0675344   .0202087     3.34   0.001     .0277613    .1073075
        172  |   .0399853   .0249448     1.60   0.110    -.0091091    .0890796
        173  |   .0294237    .019828     1.48   0.139    -.0096002    .0684476
        174  |   .2867826   .0307998     9.31   0.000     .2261649    .3474003
        175  |   .0335313   .0296799     1.13   0.260    -.0248822    .0919449
        176  |   .0493035    .026021     1.89   0.059    -.0019091    .1005161
        177  |   .0142734   .0231227     0.62   0.538    -.0312349    .0597817
        178  |   .0121452   .0234862     0.52   0.605    -.0340785    .0583689
        179  |   .0211757   .0215875     0.98   0.327     -.021311    .0636625
        180  |    .039279   .0208364     1.89   0.060    -.0017295    .0802876
        181  |   .0063601   .0218378     0.29   0.771    -.0366194    .0493397
        182  |   .7496922   .0103436    72.48   0.000     .7293348    .7700496
        183  |   .0176321   .0195747     0.90   0.368    -.0208932    .0561574
        184  |   .0066451   .0158628     0.42   0.676    -.0245748     .037865
        185  |   .1214639   .0195741     6.21   0.000     .0829397    .1599881
        186  |   .0011264   .0266511     0.04   0.966    -.0513263    .0535791
        187  |   .0574246   .0309619     1.85   0.065    -.0035121    .1183613
        188  |   .0030823   .0203796     0.15   0.880    -.0370271    .0431918
        189  |   .0018891   .0267823     0.07   0.944    -.0508216    .0545999
        190  |   .0064335   .0205643     0.31   0.755    -.0340395    .0469065
        191  |   .0120581   .0193658     0.62   0.534    -.0260562    .0501723
        192  |   .0733586   .0300759     2.44   0.015     .0141655    .1325516
        193  |   .0524376   .0262632     2.00   0.047     .0007485    .1041267
        194  |   .3312538   .0160943    20.58   0.000     .2995783    .3629292
        195  |  -.0015787   .0183165    -0.09   0.931    -.0376278    .0344703
        196  |   .1836729   .0473052     3.88   0.000     .0905705    .2767753
        197  |    .045592   .0263102     1.73   0.084    -.0061897    .0973738
        198  |  -.0047284   .0320815    -0.15   0.883    -.0678687    .0584118
        199  |  -.0203046   .0299072    -0.68   0.498    -.0791656    .0385564
        200  |   .0795102   .0244036     3.26   0.001      .031481    .1275394
        201  |  -.0651304   .0465761    -1.40   0.163    -.1567977     .026537
        202  |   .0142082    .024213     0.59   0.558    -.0334461    .0618624
        203  |   .0634614   .0252225     2.52   0.012     .0138206    .1131023
        204  |  -.0475733   .0357157    -1.33   0.184     -.117866    .0227195
        205  |   .1061315    .021275     4.99   0.000     .0642596    .1480033
        206  |  -.0376386   .0266678    -1.41   0.159    -.0901241     .014847
        207  |   .0188288   .0191982     0.98   0.328    -.0189556    .0566133
        208  |   .0317284   .0200117     1.59   0.114    -.0076571    .0711139
        209  |  -.0059505   .0231495    -0.26   0.797    -.0515116    .0396106
        210  |   .2400791   .0334994     7.17   0.000     .1741483    .3060099
        211  |   .0057502   .0225946     0.25   0.799    -.0387187    .0502192
        212  |     .03078    .018548     1.66   0.098    -.0057247    .0672848
        213  |   .0512467   .0232388     2.21   0.028     .0055099    .0969834
        214  |   .0217304   .0312886     0.69   0.488    -.0398494    .0833103
        215  |   .0508469   .0265215     1.92   0.056    -.0013506    .1030444
        216  |   .0140012   .0164044     0.85   0.394    -.0182847    .0462872
        217  |   .0075138   .0184926     0.41   0.685    -.0288818    .0439095
        218  |  -.0003817   .0304652    -0.01   0.990    -.0603409    .0595775
        219  |  -.0464839   .0552745    -0.84   0.401    -.1552708    .0623029
        220  |   .2074593   .0320626     6.47   0.000     .1443563    .2705623
        221  |  -.0304537   .0284058    -1.07   0.285    -.0863597    .0254523
        222  |   .0119064   .0189552     0.63   0.530    -.0253998    .0492125
        223  |   .0002253   .0107993     0.02   0.983    -.0210289    .0214796
        224  |   .1063891   .0267824     3.97   0.000      .053678    .1591001
        225  |   .3175156   .0233417    13.60   0.000     .2715764    .3634549
        226  |   .0879986   .0183005     4.81   0.000      .051981    .1240162
        227  |   .0606442   .0244956     2.48   0.014     .0124339    .1088544
        228  |   .1006714   .0212409     4.74   0.000     .0588667    .1424761
        229  |  -.0080121   .0331664    -0.24   0.809    -.0732876    .0572633
        230  |   .3009887   .0228555    13.17   0.000     .2560064    .3459711
        231  |    .022221   .0192838     1.15   0.250    -.0157319    .0601739
        232  |   .0325634   .0149155     2.18   0.030     .0032078     .061919
        233  |   .3179974    .034318     9.27   0.000     .2504553    .3855394
        234  |   .0210357   .0301452     0.70   0.486    -.0382937    .0803652
        235  |   .0078117    .020243     0.39   0.700    -.0320291    .0476524
        236  |   1.021036   .0301452    33.87   0.000     .9617063    1.080365
        237  |   .0100601   .0295005     0.34   0.733    -.0480005    .0681206
        238  |   .0149188   .0311824     0.48   0.633    -.0464519    .0762895
        239  |   .2000863   .0255127     7.84   0.000     .1498742    .2502984
        240  |   .3453925   .0162898    21.20   0.000     .3133321    .3774528
        241  |   .0772207   .0248493     3.11   0.002     .0283142    .1261272
        242  |   .4888767   .0330795    14.78   0.000     .4237721    .5539813
        243  |   .0055452   .0206607     0.27   0.789    -.0351177     .046208
        244  |    .139536   .0258901     5.39   0.000     .0885811    .1904909
        245  |  -.0214103   .0456762    -0.47   0.640    -.1113067    .0684861
        246  |    .011939   .0173027     0.69   0.491    -.0221148    .0459928
        247  |   .0577044   .0249751     2.31   0.022     .0085503    .1068585
        248  |   .1226342   .0205389     5.97   0.000     .0822111    .1630572
        249  |   .0338458   .0188481     1.80   0.074    -.0032496    .0709412
        250  |   .0664006    .023643     2.81   0.005     .0198683    .1129329
        251  |    .021906   .0200437     1.09   0.275    -.0175425    .0613545
        252  |    .013687   .0246452     0.56   0.579    -.0348177    .0621917
        253  |   .0026957   .0295895     0.09   0.927      -.05554    .0609313
        254  |   .0074513    .022079     0.34   0.736     -.036003    .0509055
        255  |   .0191331   .0204096     0.94   0.349    -.0210355    .0593017
        256  |   .0313544   .0238725     1.31   0.190    -.0156295    .0783383
        257  |   .0765247   .0233199     3.28   0.001     .0306282    .1224212
        258  |  -.0020556   .0290396    -0.07   0.944     -.059209    .0550979
        259  |    .094486   .0165073     5.72   0.000     .0619976    .1269745
        260  |  -.0131349   .0386937    -0.34   0.735    -.0892888     .063019
        261  |   .1830012   .0327487     5.59   0.000     .1185477    .2474547
        262  |   .0354314   .0195755     1.81   0.071    -.0030955    .0739583
        264  |   .0050668   .0205656     0.25   0.806    -.0354088    .0455425
        265  |   .0120522   .0258392     0.47   0.641    -.0388025    .0629068
        266  |   .0182821   .0174377     1.05   0.295    -.0160374    .0526016
        267  |   .0275058   .0207271     1.33   0.186    -.0132876    .0682992
        268  |  -.0041284   .0266672    -0.15   0.877    -.0566127    .0483558
        269  |  -.0119541   .0328646    -0.36   0.716    -.0766356    .0527274
        270  |   .0274518   .0236819     1.16   0.247     -.019157    .0740606
        271  |   .1042455   .0239058     4.36   0.000      .057196    .1512949
        272  |   .0162901   .0200229     0.81   0.417    -.0231174    .0556975
        273  |  -.0551825   .0553769    -1.00   0.320     -.164171    .0538059
        274  |   .0039809   .0307979     0.13   0.897    -.0566331    .0645949
        275  |    .003472   .0302438     0.11   0.909    -.0560514    .0629955
        276  |   .1379004     .02486     5.55   0.000      .088973    .1868278
        278  |  -.0169991   .0332373    -0.51   0.609    -.0824141    .0484159
        279  |   .0999919   .0161744     6.18   0.000     .0681587    .1318252
        280  |   .3091963   .0415485     7.44   0.000     .2274238    .3909687
        281  |  -.0008012   .0231396    -0.03   0.972    -.0463428    .0447404
        282  |   .0437223   .0289944     1.51   0.133    -.0133422    .1007869
        283  |   .0153946   .0260458     0.59   0.555    -.0358667     .066656
        284  |   .2063781   .0246598     8.37   0.000     .1578448    .2549115
        285  |   .0468109   .0254721     1.84   0.067    -.0033213    .0969431
        286  |    .058655   .0237979     2.46   0.014     .0118179    .1054922
        287  |   .6094791   .0277991    21.92   0.000     .5547671    .6641911
        288  |   .2120614   .0232157     9.13   0.000       .16637    .2577528
        289  |   .0924674   .0205544     4.50   0.000     .0520139     .132921
        290  |    .064787    .017204     3.77   0.000     .0309274    .0986465
        291  |   .1701723   .0189102     9.00   0.000     .1329549    .2073898
        293  |  -.0012359   .0322934    -0.04   0.969    -.0647932    .0623215
        294  |   .3892322   .0216115    18.01   0.000     .3466981    .4317663
        295  |    .036188   .0242038     1.50   0.136     -.011448    .0838239
        296  |  -.0009081   .0244717    -0.04   0.970    -.0490715    .0472553
        297  |   .0195483   .0175169     1.12   0.265    -.0149271    .0540237
             |
       _cons |  -.0333549   .0314798    -1.06   0.290    -.0953109    .0286012
------------------------------------------------------------------------------

. estimates store model_3

. // second, regress posresponse on all variables, condition BOX==1 specified
. // store regression result
. reg interview white crime ged empgap i.center i.chain_id if box == 1, cluster(chain_id)

Linear regression                               Number of obs     =      2,918
                                                F(70, 94)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1901
                                                Root MSE          =      .2259

                              (Std. Err. adjusted for 95 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
   interview |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
       white |  -.0073999   .0063287    -1.17   0.245    -.0199658    .0051659
       crime |  -.0352903    .006252    -5.64   0.000    -.0477039   -.0228768
         ged |  -.0000279   .0083713    -0.00   0.997    -.0166492    .0165934
      empgap |   .0066165   .0071984     0.92   0.360    -.0076762    .0209092
             |
      center |
          2  |   .0585951   .0818825     0.72   0.476    -.1039845    .2211747
          3  |   .0659336   .0361928     1.82   0.072    -.0059281    .1377954
          4  |   .0857177   .0486982     1.76   0.082    -.0109738    .1824091
          5  |   -.009865   .0152572    -0.65   0.519    -.0401586    .0204285
          6  |   .0203149   .0313203     0.65   0.518    -.0418722     .082502
          7  |   .0267513   .0266449     1.00   0.318    -.0261528    .0796553
          8  |  -.0235514   .0170651    -1.38   0.171    -.0574346    .0103318
          9  |  -.0186069   .0160086    -1.16   0.248    -.0503924    .0131786
         10  |   .0074694    .021465     0.35   0.729    -.0351499    .0500886
         11  |   .0528914   .0477476     1.11   0.271    -.0419125    .1476953
         12  |   .0600647   .0675038     0.89   0.376    -.0739656    .1940951
         13  |  -.0111584   .0188329    -0.59   0.555    -.0485516    .0262348
         14  |  -.0404372   .0424009    -0.95   0.343    -.1246251    .0437507
         15  |   .0366758   .0273836     1.34   0.184    -.0176949    .0910466
         16  |  -.0038494   .0169973    -0.23   0.821    -.0375979    .0298992
         17  |   .0396221   .0408857     0.97   0.335    -.0415575    .1208016
         18  |   .0766775   .0726214     1.06   0.294     -.067514    .2208689
         19  |   .0200448   .0362912     0.55   0.582    -.0520122    .0921017
         20  |  -.0163256    .024049    -0.68   0.499    -.0640755    .0314243
         21  |   .1202167   .0964049     1.25   0.215    -.0711975     .311631
         22  |  -.0082474   .0166928    -0.49   0.622    -.0413914    .0248965
         23  |   .0246896    .010993     2.25   0.027     .0028628    .0465165
         24  |  -.0104328   .0322841    -0.32   0.747    -.0745337     .053668
         25  |   .0763339   .0777593     0.98   0.329    -.0780591    .2307269
         26  |   .1939525   .0553319     3.51   0.001     .0840897    .3038153
         27  |   .0306999   .0431801     0.71   0.479    -.0550351    .1164349
         28  |   .1110203   .0606209     1.83   0.070    -.0093438    .2313844
         29  |  -.0097706   .0347158    -0.28   0.779    -.0786996    .0591585
         30  |  -.0334549   .0279893    -1.20   0.235    -.0890283    .0221185
         31  |   .0154903   .0363553     0.43   0.671     -.056694    .0876747
         32  |   .0819237   .0403253     2.03   0.045     .0018568    .1619906
         33  |  -.0288518   .0502023    -0.57   0.567    -.1285296    .0708261
         34  |  -.0068918   .0199367    -0.35   0.730    -.0464765    .0326929
         35  |   .0100772   .0311456     0.32   0.747    -.0517631    .0719175
         36  |   .0304966   .0365044     0.84   0.406    -.0419837     .102977
         37  |   .0831273   .0778156     1.07   0.288    -.0713773    .2376319
         38  |   .0153284   .0306306     0.50   0.618    -.0454893    .0761461
         39  |   .0738373   .0816317     0.90   0.368    -.0882444     .235919
         40  |   .0925668    .063431     1.46   0.148     -.033377    .2185106
         41  |  -.0175047   .0171324    -1.02   0.310    -.0515214    .0165121
         42  |  -.0175073   .0432103    -0.41   0.686    -.1033024    .0682879
         43  |   .0749843   .0517043     1.45   0.150    -.0276758    .1776445
         44  |   .0886742   .0721893     1.23   0.222    -.0546594    .2320078
        101  |    .048362   .0562581     0.86   0.392    -.0633397    .1600638
        102  |    .059239   .0682906     0.87   0.388    -.0763536    .1948315
        103  |  -.0347422   .0211208    -1.64   0.103     -.076678    .0071936
        104  |   .0387487   .0405499     0.96   0.342    -.0417641    .1192616
        105  |  -.0313437   .0180295    -1.74   0.085    -.0671417    .0044543
        106  |   .0482874   .0368142     1.31   0.193     -.024808    .1213827
        107  |  -.0322345   .0212149    -1.52   0.132    -.0743572    .0098882
        108  |   .1081871   .0762423     1.42   0.159    -.0431939    .2595681
        109  |   .2119594   .1332735     1.59   0.115    -.0526583    .4765771
        110  |   .0176352   .0300552     0.59   0.559      -.04204    .0773105
        111  |  -.0399346   .0243299    -1.64   0.104    -.0882422    .0083731
        112  |   .0131363   .0562569     0.23   0.816    -.0985631    .1248357
        113  |   .0493379   .0653723     0.75   0.452    -.0804604    .1791363
        114  |  -.0128013   .0195964    -0.65   0.515    -.0517105    .0261078
        115  |  -.0341637    .019869    -1.72   0.089    -.0736141    .0052868
        116  |   .0530094   .0393435     1.35   0.181    -.0251079    .1311268
        117  |   .0353156   .0415818     0.85   0.398    -.0472459    .1178772
        118  |   .1013007   .1108833     0.91   0.363    -.1188607     .321462
        119  |   .2068069   .0827323     2.50   0.014     .0425399    .3710738
        120  |   .1913828   .0717515     2.67   0.009     .0489184    .3338471
        121  |   .0206773   .0394405     0.52   0.601    -.0576328    .0989875
        122  |  -.0013091   .0237007    -0.06   0.956    -.0483675    .0457492
        123  |   .1356239   .0204817     6.62   0.000      .094957    .1762908
        124  |   .1036024   .1185051     0.87   0.384    -.1316922    .3388969
        125  |   .0723913   .0454187     1.59   0.114    -.0177886    .1625712
        126  |    .083553   .0757303     1.10   0.273    -.0668113    .2339172
        127  |  -.0142581   .0250691    -0.57   0.571    -.0640334    .0355171
        128  |  -.0286122   .0186414    -1.53   0.128     -.065625    .0084007
        129  |   .0776637    .059355     1.31   0.194    -.0401871    .1955145
        130  |  -.0227685   .0208828    -1.09   0.278    -.0642318    .0186947
        131  |   .0950677   .0934185     1.02   0.311     -.090417    .2805524
        132  |   .1692723   .1366583     1.24   0.219     -.102066    .4406105
        133  |  -.0103615    .028346    -0.37   0.716    -.0666431    .0459201
        134  |  -.0090593   .0533279    -0.17   0.865    -.1149431    .0968246
        135  |   .0525946   .0402734     1.31   0.195    -.0273692    .1325585
        136  |   .1174383   .1156298     1.02   0.312    -.1121474    .3470241
        137  |   .1097271   .0802083     1.37   0.175    -.0495282    .2689825
        138  |  -.0139894   .0226359    -0.62   0.538    -.0589335    .0309547
        139  |   -.024761   .0241336    -1.03   0.308    -.0726789    .0231569
        140  |  -.0212692   .0210114    -1.01   0.314    -.0629879    .0204494
             |
    chain_id |
         13  |  -.0048314   .0185636    -0.26   0.795    -.0416899    .0320271
         20  |  -.0231814   .0435162    -0.53   0.595    -.1095839    .0632211
         22  |  -.0306059   .0395468    -0.77   0.441     -.109127    .0479152
         34  |   .0187421   .0335162     0.56   0.577     -.047805    .0852892
         36  |  -.0345748   .0397633    -0.87   0.387    -.1135257    .0443761
         43  |  -.0063813   .0458579    -0.14   0.890    -.0974333    .0846708
         46  |   .0206959   .0325798     0.64   0.527    -.0439921    .0853839
         47  |  -.0965808   .0815906    -1.18   0.240    -.2585809    .0654192
         54  |  -.0097492   .0284359    -0.34   0.732    -.0662095     .046711
         55  |  -.0296816   .0742903    -0.40   0.690    -.1771867    .1178236
         57  |   -.044952   .0442833    -1.02   0.313    -.1328776    .0429737
         65  |  -.0196382   .0599616    -0.33   0.744    -.1386934     .099417
         70  |   .0043674   .0413559     0.11   0.916    -.0777456    .0864805
         74  |   .0894677   .0304402     2.94   0.004     .0290281    .1499073
         75  |   .1267794   .0320351     3.96   0.000      .063173    .1903859
         77  |   .0114821    .041389     0.28   0.782    -.0706966    .0936608
         78  |   .0685343   .0457802     1.50   0.138    -.0223633    .1594319
         79  |  -.1118626   .0723921    -1.55   0.126    -.2555988    .0318736
         90  |   .7098782   .0332188    21.37   0.000     .6439215    .7758349
         96  |  -.0123196   .0305054    -0.40   0.687    -.0728888    .0482496
         97  |  -.0333917   .0616534    -0.54   0.589     -.155806    .0890226
        101  |   .0006453   .0318171     0.02   0.984    -.0625282    .0638188
        102  |   .0042061    .039629     0.11   0.916    -.0744782    .0828905
        103  |  -.0209069   .0206482    -1.01   0.314    -.0619044    .0200905
        107  |   .0614437   .0534174     1.15   0.253    -.0446178    .1675053
        109  |  -.0226503   .0279537    -0.81   0.420     -.078153    .0328524
        112  |  -.1899567     .13366    -1.42   0.159    -.4553417    .0754283
        116  |   .0174224   .0177727     0.98   0.329    -.0178658    .0527106
        120  |   .5999438   .0317612    18.89   0.000     .5368813    .6630063
        121  |   .0682458   .0370784     1.84   0.069    -.0053743    .1418659
        127  |   -.008697   .0285699    -0.30   0.761    -.0654232    .0480293
        136  |  -.0306059   .0395468    -0.77   0.441     -.109127    .0479152
        137  |  -.0076807   .0483157    -0.16   0.874    -.1036127    .0882512
        138  |   .5638167   .0364244    15.48   0.000     .4914952    .6361381
        141  |  -.0126094   .0272989    -0.46   0.645     -.066812    .0415932
        142  |   .0121867   .0337321     0.36   0.719    -.0547893    .0791626
        143  |  -.0027009   .0400071    -0.07   0.946    -.0821358    .0767341
        144  |   .0207947   .0228216     0.91   0.365    -.0245181    .0661075
        145  |  -.0105883   .0245012    -0.43   0.667     -.059236    .0380595
        146  |  -.0227671   .0326126    -0.70   0.487    -.0875201    .0419859
        147  |   -.070017    .051469    -1.36   0.177    -.1722099     .032176
        148  |   .0591317   .0487766     1.21   0.228    -.0377155    .1559788
        149  |  -.0208453   .0548471    -0.38   0.705    -.1297454    .0880549
        150  |  -.0423726   .0665963    -0.64   0.526    -.1746012     .089856
        151  |   .0511757   .0379828     1.35   0.181    -.0242402    .1265915
        153  |   .0109634   .0324422     0.34   0.736    -.0534513    .0753781
        154  |     .18412   .0382566     4.81   0.000     .1081607    .2600793
        156  |  -.0397232   .0525625    -0.76   0.452    -.1440872    .0646409
        158  |   .5088385   .0621662     8.19   0.000      .385406     .632271
        160  |   .0115074   .0195276     0.59   0.557     -.027265    .0502798
        161  |   .0657203   .0533764     1.23   0.221    -.0402599    .1717004
        162  |   .0442092   .0367226     1.20   0.232    -.0287045    .1171229
        163  |   .2407591   .0324356     7.42   0.000     .1763575    .3051607
        168  |  -.0217491   .0458091    -0.47   0.636    -.1127041    .0692058
        171  |   .0530315   .0288636     1.84   0.069    -.0042778    .1103408
        179  |   .0057387   .0347961     0.16   0.869    -.0633498    .0748272
        181  |   .0141009   .0347252     0.41   0.686    -.0548468    .0830486
        182  |   .9913027   .0085679   115.70   0.000      .974291    1.008314
        185  |   .0248455   .0298785     0.83   0.408    -.0344789      .08417
        187  |  -.1275411   .0878923    -1.45   0.150    -.3020533    .0469711
        194  |    .326838   .0293166    11.15   0.000     .2686291    .3850468
        196  |   .1943181    .080315     2.42   0.017     .0348507    .3537854
        199  |  -.0268378   .0454569    -0.59   0.556    -.1170935    .0634179
        200  |     .05113   .0400825     1.28   0.205    -.0284548    .1307148
        203  |   .0911626   .0424972     2.15   0.035     .0067835    .1755417
        204  |  -.0427705   .0416478    -1.03   0.307    -.1254632    .0399222
        205  |   .0713461   .0366982     1.94   0.055    -.0015191    .1442113
        208  |  -.0035154   .0352304    -0.10   0.921    -.0734662    .0664354
        209  |  -.0252281   .0317656    -0.79   0.429    -.0882994    .0378432
        210  |   .4496114    .055674     8.08   0.000     .3390693    .5601534
        212  |   .0129058    .030054     0.43   0.669    -.0467673    .0725788
        215  |   .0651635   .0472781     1.38   0.171    -.0287083    .1590353
        220  |    .303025   .0666381     4.55   0.000     .1707136    .4353365
        223  |  -.0120334   .0123011    -0.98   0.330    -.0364576    .0123908
        225  |    .192296   .0275491     6.98   0.000     .1375966    .2469955
        227  |    .070041   .0298204     2.35   0.021      .010832      .12925
        229  |    -.04361   .0912733    -0.48   0.634    -.2248353    .1376153
        230  |   .2856923   .0311578     9.17   0.000     .2238276    .3475569
        232  |   .0295073   .0206499     1.43   0.156    -.0114936    .0705082
        236  |   1.029034   .0363357    28.32   0.000      .956889     1.10118
        239  |   .0905479   .0361922     2.50   0.014     .0186875    .1624083
        241  |   .0481982   .0360483     1.34   0.184    -.0233765     .119773
        242  |   .0269033   .0633054     0.42   0.672    -.0987911    .1525976
        246  |   .0271765   .0300269     0.91   0.368    -.0324426    .0867957
        247  |   -.006926   .0357478    -0.19   0.847    -.0779041    .0640521
        252  |  -.0061685   .0373086    -0.17   0.869    -.0802456    .0679085
        255  |  -.0048393   .0324265    -0.15   0.882    -.0692229    .0595443
        259  |   .1873662   .0274466     6.83   0.000     .1328702    .2418621
        260  |  -.0001863   .0543759    -0.00   0.997    -.1081509    .1077782
        269  |  -.1872775   .0694765    -2.70   0.008    -.3252247   -.0493303
        270  |   .0148528   .0317985     0.47   0.642     -.048284    .0779895
        289  |   .0447748   .0343739     1.30   0.196    -.0234755     .113025
        291  |   .0296578   .0341402     0.87   0.387    -.0381284     .097444
        297  |  -.0088933   .0261724    -0.34   0.735    -.0608592    .0430725
             |
       _cons |  -.0039379   .0420744    -0.09   0.926    -.0874776    .0796018
------------------------------------------------------------------------------

. estimates store model_4

. // finally, establish table using model_1 and model_2
. esttab model_3 model_4 using "result_e", ///
> rtf replace se ///
> stats(N, labels("N")) ///
> drop(_cons *.center *.chain_id)
(output written to result_e.rtf)

. 
. //Question (g)
. tab balanced

Application |
      is in |
   balanced |
     sample |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,449       23.56       23.56
          1 |     11,188       76.44      100.00
------------+-----------------------------------
      Total |     14,637      100.00

. 
. //Question (h)
. // gen interaction terms
. gen boxwhite = box * white

. gen prewhite = pre * white 

. // do regression, clustered in chain, control for ged empgap
. // col 1: control center, only pre-BTB
. regress posresponse boxwhite white box ged empgap i.center if pre == 1, cluster(chain_id)

Linear regression                               Number of obs     =      7,245
                                                F(88, 292)        =       9.22
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0341
                                                Root MSE          =     .30874

                             (Std. Err. adjusted for 293 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
 posresponse |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    boxwhite |  -.0302277   .0152729    -1.98   0.049    -.0602866   -.0001687
       white |   .0315233   .0120062     2.63   0.009     .0078936     .055153
         box |   .0150434    .024479     0.61   0.539    -.0331343    .0632212
         ged |  -.0059729   .0074348    -0.80   0.422    -.0206055    .0086597
      empgap |  -.0022208   .0078497    -0.28   0.777    -.0176699    .0132284
             |
      center |
          2  |   .0036386   .0531164     0.07   0.945    -.1009009    .1081781
          3  |    .003212   .0496786     0.06   0.948    -.0945615    .1009855
          4  |  -.0034353   .0483088    -0.07   0.943    -.0985129    .0916423
          5  |   -.039603   .0419931    -0.94   0.346    -.1222505    .0430445
          6  |   .0200292   .0537843     0.37   0.710    -.0858249    .1258832
          7  |   -.040747   .0354343    -1.15   0.251    -.1104859     .028992
          8  |  -.0349564   .0406011    -0.86   0.390    -.1148643    .0449514
          9  |  -.0355148   .0424369    -0.84   0.403    -.1190357    .0480061
         10  |  -.0336695   .0421896    -0.80   0.425    -.1167037    .0493647
         11  |   .0405205   .0494248     0.82   0.413    -.0567535    .1377944
         12  |  -.0124642   .0509456    -0.24   0.807    -.1127313     .087803
         13  |   .0304631   .0534688     0.57   0.569    -.0747699    .1356962
         14  |  -.0201565   .0449014    -0.45   0.654    -.1085278    .0682149
         15  |  -.0219883   .0379433    -0.58   0.563    -.0966652    .0526886
         16  |  -.0358298   .0413934    -0.87   0.387    -.1172971    .0456375
         17  |  -.0044646   .0413445    -0.11   0.914    -.0858356    .0769064
         18  |  -.0047385   .0695327    -0.07   0.946    -.1415873    .1321103
         19  |   -.042167   .0416213    -1.01   0.312    -.1240828    .0397487
         20  |  -.0424894   .0403892    -1.05   0.294    -.1219803    .0370016
         21  |    .002201   .0569949     0.04   0.969    -.1099718    .1143738
         22  |  -.0342362   .0371878    -0.92   0.358    -.1074263    .0389538
         23  |  -.0184154    .040817    -0.45   0.652    -.0987482    .0619174
         24  |  -.0465017   .0370688    -1.25   0.211    -.1194577    .0264543
         25  |  -.0165363   .0586158    -0.28   0.778    -.1318993    .0988267
         26  |   .0319569    .053878     0.59   0.554    -.0740815    .1379953
         27  |   .0397805   .0501573     0.79   0.428    -.0589351    .1384961
         28  |   .0435399   .0553735     0.79   0.432    -.0654418    .1525216
         29  |  -.0599346   .0365519    -1.64   0.102    -.1318731    .0120039
         30  |  -.0801208   .0360536    -2.22   0.027    -.1510787    -.009163
         31  |  -.0153692    .048865    -0.31   0.753    -.1115415     .080803
         32  |  -.0069761   .0541162    -0.13   0.898    -.1134834    .0995313
         33  |   .0136724   .0458042     0.30   0.766    -.0764758    .1038205
         34  |   -.063596   .0335853    -1.89   0.059     -.129696     .002504
         35  |  -.0100625   .0370929    -0.27   0.786    -.0830658    .0629407
         36  |  -.0265078   .0402898    -0.66   0.511    -.1058029    .0527874
         37  |   .0240788   .0550402     0.44   0.662     -.084247    .1324047
         38  |  -.0005017   .0475401    -0.01   0.992    -.0940664    .0930631
         39  |  -.0549032   .0460386    -1.19   0.234    -.1455127    .0357063
         40  |   .0365047   .0560193     0.65   0.515     -.073748    .1467574
         41  |  -.0353136    .042306    -0.83   0.405    -.1185771    .0479498
         42  |  -.0149825   .0505386    -0.30   0.767    -.1144486    .0844837
         43  |   .0425814   .0492724     0.86   0.388    -.0543927    .1395555
         44  |   .0086985   .0486304     0.18   0.858     -.087012     .104409
        101  |   .1300246   .0655637     1.98   0.048     .0009873    .2590618
        102  |   .1186962   .0964234     1.23   0.219    -.0710767    .3084691
        103  |   .0538031   .0797904     0.67   0.501    -.1032341    .2108404
        104  |   .0684148   .0624712     1.10   0.274    -.0545362    .1913657
        105  |   .0994582   .0654042     1.52   0.129    -.0292653    .2281817
        106  |   .0895201   .0622686     1.44   0.152     -.033032    .2120722
        107  |   .0141413   .0508085     0.28   0.781     -.085856    .1141386
        108  |   .0612903   .0624314     0.98   0.327    -.0615822    .1841629
        109  |    .137437   .0684735     2.01   0.046     .0026728    .2722011
        110  |  -.0644853   .0384521    -1.68   0.095    -.1401638    .0111932
        111  |   .0177132   .0470221     0.38   0.707    -.0748321    .1102584
        112  |   .0813709   .0761309     1.07   0.286    -.0684639    .2312058
        113  |   .1549499   .0907498     1.71   0.089    -.0236567    .3335565
        114  |  -.0101531   .0523508    -0.19   0.846    -.1131858    .0928796
        115  |  -.0572089    .049342    -1.16   0.247      -.15432    .0399021
        116  |   .0607953   .0495421     1.23   0.221    -.0367096    .1583002
        117  |    .101759   .0548804     1.85   0.065    -.0062523    .2097704
        118  |   .0306603   .0940685     0.33   0.745     -.154478    .2157986
        119  |   .0423626   .0659609     0.64   0.521    -.0874564    .1721817
        120  |   .0758597   .0551448     1.38   0.170     -.032672    .1843913
        121  |  -.0534643   .0397391    -1.35   0.180    -.1316757    .0247471
        122  |   .0820829   .0575626     1.43   0.155    -.0312073     .195373
        123  |   .0945805   .0920644     1.03   0.305    -.0866135    .2757744
        124  |   .0460802   .0800886     0.58   0.565    -.1115438    .2037043
        125  |    .062693   .0558802     1.12   0.263     -.047286     .172672
        126  |    .023694     .06023     0.39   0.694     -.094846     .142234
        127  |   -.024468   .0492529    -0.50   0.620    -.1214036    .0724676
        128  |   .0042387   .0993573     0.04   0.966    -.1913086     .199786
        129  |   .1759401    .067834     2.59   0.010     .0424346    .3094456
        130  |  -.0195169   .0577901    -0.34   0.736    -.1332548     .094221
        131  |   .1690021   .0855395     1.98   0.049     .0006501    .3373542
        132  |   .1850894    .141561     1.31   0.192    -.0935199    .4636987
        133  |  -.0338125   .0628665    -0.54   0.591    -.1575415    .0899165
        134  |  -.0075125   .0508348    -0.15   0.883    -.1075617    .0925366
        135  |  -.0067283   .0459517    -0.15   0.884    -.0971668    .0837103
        136  |   .0422021   .0827317     0.51   0.610     -.120624    .2050282
        137  |   .0256326   .0569573     0.45   0.653    -.0864663    .1377316
        138  |  -.0411874   .0400497    -1.03   0.305    -.1200099    .0376352
        139  |    .137685   .1456363     0.95   0.345    -.1489448    .4243149
        140  |  -.0144945   .0538355    -0.27   0.788    -.1204493    .0914602
             |
       _cons |   .0847219   .0386757     2.19   0.029     .0086035    .1608404
------------------------------------------------------------------------------

. estimates store mod1

. // col 2: only box remover and balanced observations
. regress posresponse boxwhite white box ged empgap if remover == 1 & balanced == 1, cluster(chain_id)

Linear regression                               Number of obs     =      3,712
                                                F(5, 61)          =       3.63
                                                Prob > F          =     0.0061
                                                R-squared         =     0.0031
                                                Root MSE          =     .32236

                              (Std. Err. adjusted for 62 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
 posresponse |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    boxwhite |  -.0364168   .0139034    -2.62   0.011    -.0642184   -.0086152
       white |   .0441999   .0126019     3.51   0.001     .0190008    .0693991
         box |   .0031653    .014917     0.21   0.833    -.0266631    .0329936
         ged |   .0069219   .0108355     0.64   0.525     -.014745    .0285887
      empgap |   .0041314   .0092161     0.45   0.656    -.0142974    .0225603
       _cons |   .0978846   .0209526     4.67   0.000     .0559871     .139782
------------------------------------------------------------------------------

. estimates store mod2

. // col 3: control center, only box remover
. regress posresponse boxwhite white box ged empgap i.center if remover == 1, cluster(chain_id)

Linear regression                               Number of obs     =      4,794
                                                F(66, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0437
                                                Root MSE          =     .32047

                              (Std. Err. adjusted for 71 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
 posresponse |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    boxwhite |  -.0327427   .0138082    -2.37   0.020    -.0602823   -.0052031
       white |   .0401223   .0117161     3.42   0.001     .0167553    .0634892
         box |  -.0017475   .0132681    -0.13   0.896    -.0282099     .024715
         ged |   .0068817   .0072476     0.95   0.346    -.0075731    .0213365
      empgap |    .003483   .0078577     0.44   0.659    -.0121886    .0191546
             |
      center |
          2  |  -.0477459    .078185    -0.61   0.543    -.2036809    .1081892
          3  |   .0212228   .0538259     0.39   0.695    -.0861297    .1285753
          4  |  -.0708249   .0578995    -1.22   0.225    -.1863019     .044652
          5  |  -.1271217    .046911    -2.71   0.008    -.2206828   -.0335606
          6  |  -.0929589   .0543814    -1.71   0.092    -.2014191    .0155013
          7  |  -.1013354   .0597657    -1.70   0.094    -.2205344    .0178635
          8  |  -.1116172    .047968    -2.33   0.023    -.2072863    -.015948
          9  |  -.0737238   .0505468    -1.46   0.149    -.1745362    .0270886
         10  |  -.1319205   .0514685    -2.56   0.013    -.2345712   -.0292698
         11  |  -.0325089    .066114    -0.49   0.624    -.1643691    .0993513
         12  |  -.0718501   .0668104    -1.08   0.286    -.2050993    .0613991
         13  |  -.0849566   .0686811    -1.24   0.220    -.2219368    .0520236
         14  |  -.0960073   .0425027    -2.26   0.027    -.1807762   -.0112384
         15  |   -.052527   .0554944    -0.95   0.347     -.163207    .0581531
         16  |  -.0763075   .0585832    -1.30   0.197    -.1931479     .040533
         17  |  -.0241499   .0640063    -0.38   0.707    -.1518063    .1035066
         18  |  -.1474104   .0474522    -3.11   0.003    -.2420509     -.05277
         19  |  -.0843525   .0550727    -1.53   0.130    -.1941914    .0254865
         20  |  -.0890835   .0433998    -2.05   0.044    -.1756416   -.0025254
         21  |   .0299168    .095282     0.31   0.754    -.1601171    .2199508
         22  |  -.0815761    .052593    -1.55   0.125    -.1864696    .0233174
         23  |  -.0887091   .0521301    -1.70   0.093    -.1926793     .015261
         24  |  -.0574465   .0489022    -1.17   0.244    -.1549789    .0400859
         25  |  -.0670538   .0594654    -1.13   0.263    -.1856538    .0515461
         26  |   .0109444   .0662242     0.17   0.869    -.1211356    .1430244
         27  |   .0127534   .0709091     0.18   0.858    -.1286704    .1541772
         28  |   .0183723   .0829751     0.22   0.825    -.1471162    .1838609
         29  |  -.0609131   .0681909    -0.89   0.375    -.1969156    .0750893
         30  |  -.0819634   .0503732    -1.63   0.108    -.1824296    .0185027
         31  |   .0013192   .0862142     0.02   0.988    -.1706296    .1732679
         32  |  -.0125033   .0630116    -0.20   0.843     -.138176    .1131693
         33  |   -.021179    .069008    -0.31   0.760     -.158811     .116453
         34  |   -.089077   .0596115    -1.49   0.140    -.2079682    .0298143
         35  |   -.026401   .0711514    -0.37   0.712     -.168308    .1155061
         36  |  -.0688835   .0589765    -1.17   0.247    -.1865084    .0487415
         37  |  -.0527224      .0773    -0.68   0.497    -.2068925    .1014476
         38  |   .0922162   .0851505     1.08   0.283    -.0776112    .2620436
         39  |  -.1011774   .0555761    -1.82   0.073    -.2120204    .0096656
         40  |  -.0111013    .069369    -0.16   0.873    -.1494535    .1272509
         41  |  -.0430063   .0962651    -0.45   0.656     -.235001    .1489885
         42  |  -.0671148   .0659738    -1.02   0.313    -.1986953    .0644658
         43  |   .0116764    .074375     0.16   0.876    -.1366598    .1600127
         44  |   -.002398    .096486    -0.02   0.980    -.1948332    .1900372
        101  |   .0562838   .0813965     0.69   0.492    -.1060564    .2186239
        102  |   .1091782   .1229332     0.89   0.378    -.1360043    .3543606
        103  |  -.1456213   .0466428    -3.12   0.003    -.2386475   -.0525951
        104  |  -.0397319   .0554265    -0.72   0.476    -.1502766    .0708128
        105  |   .0394802   .0761072     0.52   0.606    -.1123108    .1912712
        106  |  -.0133536   .0585412    -0.23   0.820    -.1301103    .1034031
        107  |  -.0178057   .0717414    -0.25   0.805    -.1608894    .1252779
        108  |   .0222071    .080831     0.27   0.784    -.1390052    .1834194
        109  |   .1615295   .1221114     1.32   0.190    -.0820139    .4050729
        110  |  -.0747524   .0569877    -1.31   0.194    -.1884107     .038906
        111  |  -.0593985   .0536204    -1.11   0.272     -.166341     .047544
        112  |   .0942076   .1144096     0.82   0.413    -.1339751    .3223903
        113  |   -.025653   .0711689    -0.36   0.720     -.167595     .116289
        114  |   .0946115   .1058537     0.89   0.374     -.116507    .3057301
        115  |  -.0933989   .0635368    -1.47   0.146     -.220119    .0333212
        116  |   -.015343   .0625262    -0.25   0.807    -.1400476    .1093615
        117  |   .0487517   .0773789     0.63   0.531    -.1055757     .203079
        118  |   .0301669   .1132506     0.27   0.791    -.1957043    .2560381
        119  |  -.0293613   .0833032    -0.35   0.726    -.1955043    .1367817
        120  |   .0377426   .0738474     0.51   0.611    -.1095414    .1850265
        121  |  -.0720793   .0556986    -1.29   0.200    -.1831667     .039008
        122  |  -.0403525   .0701179    -0.58   0.567    -.1801983    .0994932
        123  |  -.0626058   .0470536    -1.33   0.188    -.1564512    .0312396
        124  |  -.0094698   .0658964    -0.14   0.886    -.1408961    .1219565
        125  |    .053376   .0714703     0.75   0.458     -.089167    .1959189
        126  |   .2028398   .0877453     2.31   0.024     .0278374    .3778422
        127  |  -.1098751   .0570956    -1.92   0.058    -.2237488    .0039985
        128  |   .0394103   .1104401     0.36   0.722    -.1808555    .2596761
        129  |    .122643   .0786944     1.56   0.124     -.034308    .2795941
        130  |  -.0017473   .0873375    -0.02   0.984    -.1759364    .1724418
        131  |  -.0202032   .0805003    -0.25   0.803     -.180756    .1403496
        132  |   .1026251   .1043718     0.98   0.329    -.1055378     .310788
        133  |  -.1450106   .0461707    -3.14   0.002    -.2370951   -.0529262
        134  |   .0130348   .1015953     0.13   0.898    -.1895906    .2156602
        135  |   .0761489   .0596696     1.28   0.206    -.0428584    .1951561
        136  |   .0213058   .1160109     0.18   0.855    -.2100706    .2526821
        137  |  -.0745497   .0637972    -1.17   0.247    -.2017893    .0526899
        138  |  -.0698736   .0576865    -1.21   0.230    -.1849256    .0451784
        139  |   .0660973   .0860803     0.77   0.445    -.1055843    .2377789
        140  |   .0688143   .0694397     0.99   0.325    -.0696788    .2073075
             |
       _cons |   .1297551   .0464402     2.79   0.007      .037133    .2223772
------------------------------------------------------------------------------

. estimates store mod3

. // col 4: prewhite, only box remover and balanced observations
. regress posresponse prewhite white pre ged empgap if balanced == 1 & remover == 0, cluster(chain_id)

Linear regression                               Number of obs     =      7,476
                                                F(5, 180)         =       1.92
                                                Prob > F          =     0.0925
                                                R-squared         =     0.0021
                                                Root MSE          =     .31262

                             (Std. Err. adjusted for 181 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
 posresponse |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    prewhite |   .0020343   .0137967     0.15   0.883    -.0251899    .0292584
       white |   .0221117   .0088202     2.51   0.013     .0047074     .039516
         pre |  -.0159083   .0174611    -0.91   0.363     -.050363    .0185464
         ged |   -.007889   .0083419    -0.95   0.346    -.0243494    .0085715
      empgap |   .0040885   .0074011     0.55   0.581    -.0105157    .0186926
       _cons |   .1082379   .0275433     3.93   0.000     .0538886    .1625871
------------------------------------------------------------------------------

. estimates store mod5

. // gen table
. esttab  mod1 mod2 mod3 mod5 using "result_h", ///
> rtf replace se ///
> stats(N, labels("N")) ///
> drop(_cons *.center ged empgap)
(output written to result_h.rtf)

. 
. 
. //Question (i)
. // do regression, clustered in chain, control for ged empgap
. // col 1: control center, only pre-BTB
. regress interview boxwhite white box ged empgap i.center if pre == 1, cluster(chain_id)

Linear regression                               Number of obs     =      7,245
                                                F(88, 292)        =       4.52
                                                Prob > F          =     0.0000
                                                R-squared         =     0.0249
                                                Root MSE          =     .23554

                             (Std. Err. adjusted for 293 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
   interview |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    boxwhite |  -.0262249   .0100792    -2.60   0.010     -.046062   -.0063877
       white |   .0169184   .0070136     2.41   0.016     .0031148    .0307219
         box |   .0225795   .0154968     1.46   0.146      -.00792     .053079
         ged |  -.0024352   .0061447    -0.40   0.692    -.0145286    .0096582
      empgap |   -.000295   .0052063    -0.06   0.955    -.0105416    .0099516
             |
      center |
          2  |   .0268924   .0357572     0.75   0.453     -.043482    .0972669
          3  |   .0215008   .0259788     0.83   0.409    -.0296286    .0726302
          4  |   .0374829   .0309924     1.21   0.227    -.0235139    .0984796
          5  |    .006524   .0295752     0.22   0.826    -.0516836    .0647316
          6  |   .0110206   .0224859     0.49   0.624    -.0332344    .0552757
          7  |  -.0053802   .0221502    -0.24   0.808    -.0489744     .038214
          8  |  -.0066876   .0261159    -0.26   0.798    -.0580869    .0447116
          9  |   .0230546   .0318178     0.72   0.469    -.0395667     .085676
         10  |   .0173811   .0282867     0.61   0.539    -.0382906    .0730528
         11  |   .0662333   .0325937     2.03   0.043     .0020849    .1303818
         12  |   .0260878   .0348401     0.75   0.455    -.0424818    .0946574
         13  |   .0106842   .0266552     0.40   0.689    -.0417764    .0631448
         14  |   .0146047   .0246062     0.59   0.553    -.0338232    .0630326
         15  |   .0170326   .0225184     0.76   0.450    -.0272862    .0613515
         16  |  -.0172788   .0191996    -0.90   0.369    -.0550659    .0205084
         17  |   .0535665   .0407961     1.31   0.190    -.0267252    .1338582
         18  |   .0182516   .0481525     0.38   0.705    -.0765185    .1130216
         19  |  -.0003358   .0235065    -0.01   0.989    -.0465995    .0459278
         20  |  -.0007345   .0255673    -0.03   0.977    -.0510542    .0495851
         21  |   .0469734   .0408118     1.15   0.251    -.0333493     .127296
         22  |  -.0064226   .0218936    -0.29   0.769    -.0495119    .0366668
         23  |   .0246337   .0249877     0.99   0.325    -.0245452    .0738126
         24  |  -.0028184   .0180042    -0.16   0.876    -.0382527     .032616
         25  |   .0206081   .0393708     0.52   0.601    -.0568785    .0980946
         26  |    .057744   .0438389     1.32   0.189    -.0285362    .1440243
         27  |   .0310828   .0285546     1.09   0.277    -.0251161    .0872817
         28  |   .0426564   .0333266     1.28   0.202    -.0229344    .1082472
         29  |  -.0008881   .0233451    -0.04   0.970    -.0468341    .0450579
         30  |  -.0277716   .0171694    -1.62   0.107    -.0615631    .0060199
         31  |   .0270089   .0321845     0.84   0.402    -.0363341    .0903519
         32  |   .0285285   .0285532     1.00   0.319    -.0276677    .0847246
         33  |    .012612   .0246296     0.51   0.609    -.0358621    .0610861
         34  |   -.019175   .0140481    -1.36   0.173    -.0468234    .0084734
         35  |   .0008645    .022978     0.04   0.970     -.044359    .0460881
         36  |   .0215586   .0288481     0.75   0.455     -.035218    .0783353
         37  |   .0688321   .0446293     1.54   0.124    -.0190037    .1566679
         38  |   -.000546   .0243655    -0.02   0.982    -.0485001    .0474082
         39  |   .0044011   .0301044     0.15   0.884    -.0548481    .0636503
         40  |   .0923326   .0514396     1.79   0.074    -.0089068     .193572
         41  |   .0038858   .0235821     0.16   0.869    -.0425267    .0502982
         42  |  -.0155546    .020386    -0.76   0.446    -.0556767    .0245676
         43  |   .0463663   .0314852     1.47   0.142    -.0156005     .108333
         44  |    .017097   .0284143     0.60   0.548    -.0388258    .0730199
        101  |   .0867258   .0386926     2.24   0.026      .010574    .1628775
        102  |   .0515245    .046709     1.10   0.271    -.0404046    .1434535
        103  |   .0620301   .0671498     0.92   0.356    -.0701287     .194189
        104  |   .0823453   .0442885     1.86   0.064    -.0048198    .1695103
        105  |   .0372362   .0345512     1.08   0.282    -.0307648    .1052371
        106  |   .0855217   .0423207     2.02   0.044     .0022293     .168814
        107  |   .0240748   .0287873     0.84   0.404    -.0325821    .0807317
        108  |   .0900306   .0468273     1.92   0.056    -.0021311    .1821923
        109  |   .0894379   .0540956     1.65   0.099    -.0170288    .1959046
        110  |  -.0032934   .0223385    -0.15   0.883    -.0472582    .0406714
        111  |   .0180707   .0280569     0.64   0.520    -.0371486      .07329
        112  |    .056528   .0398511     1.42   0.157    -.0219037    .1349598
        113  |    .146662   .0827823     1.77   0.077    -.0162635    .3095875
        114  |    .016345   .0348663     0.47   0.640     -.052276    .0849661
        115  |   .0110223   .0403801     0.27   0.785    -.0684506    .0904952
        116  |   .0550845   .0357616     1.54   0.125    -.0152986    .1254676
        117  |   .0808587   .0340656     2.37   0.018     .0138134    .1479039
        118  |   .0563823   .0582987     0.97   0.334    -.0583566    .1711212
        119  |   .0895817   .0512635     1.75   0.082    -.0113111    .1904745
        120  |   .1086124   .0479874     2.26   0.024     .0141674    .2030574
        121  |   .0021646   .0262069     0.08   0.934    -.0494137    .0537428
        122  |   .0504146   .0284213     1.77   0.077     -.005522    .1063513
        123  |   .0499263    .052239     0.96   0.340    -.0528864    .1527389
        124  |   .0816242   .0698916     1.17   0.244    -.0559309    .2191794
        125  |   .0514809   .0340205     1.51   0.131    -.0154755    .1184373
        126  |   .0522813    .049444     1.06   0.291    -.0450304     .149593
        127  |   .0211295   .0374651     0.56   0.573    -.0526064    .0948654
        128  |  -.0276224   .0172719    -1.60   0.111    -.0616156    .0063709
        129  |   .1354949   .0488928     2.77   0.006     .0392679    .2317219
        130  |  -.0074383    .025934    -0.29   0.774    -.0584795    .0436029
        131  |   .1191261   .0543469     2.19   0.029     .0121649    .2260873
        132  |   .1347063   .1064195     1.27   0.207    -.0747403    .3441529
        133  |   .0349285   .0542917     0.64   0.521    -.0719241     .141781
        134  |   .0115831   .0266445     0.43   0.664    -.0408566    .0640228
        135  |    .029979   .0274694     1.09   0.276    -.0240841    .0840422
        136  |   .0746895   .0713211     1.05   0.296     -.065679     .215058
        137  |    .073209   .0511576     1.43   0.153    -.0274754    .1738934
        138  |    -.01239   .0216828    -0.57   0.568    -.0550645    .0302844
        139  |  -.0269913   .0171746    -1.57   0.117    -.0607929    .0068103
        140  |   .0210546   .0411732     0.51   0.609    -.0599792    .1020885
             |
       _cons |    .016985   .0186484     0.91   0.363    -.0197173    .0536873
------------------------------------------------------------------------------

. estimates store mod21

. // col 2: only box remover and balanced observations
. regress interview boxwhite white box ged empgap if remover == 1 & balanced == 1, cluster(chain_id)

Linear regression                               Number of obs     =      3,712
                                                F(5, 61)          =       1.99
                                                Prob > F          =     0.0927
                                                R-squared         =     0.0032
                                                Root MSE          =     .26388

                              (Std. Err. adjusted for 62 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
   interview |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    boxwhite |  -.0409267   .0162768    -2.51   0.015    -.0734742   -.0083793
       white |   .0398798   .0181389     2.20   0.032     .0036088    .0761508
         box |   .0107728   .0090413     1.19   0.238    -.0073064     .028852
         ged |   .0008179   .0061996     0.13   0.895     -.011579    .0132149
      empgap |   .0007925   .0048374     0.16   0.870    -.0088806    .0104655
       _cons |    .059532   .0114571     5.20   0.000      .036622    .0824419
------------------------------------------------------------------------------

. estimates store mod22

. // col 3: control center, only box remover
. regress interview boxwhite white box ged empgap i.center if remover == 1, cluster(chain_id)

Linear regression                               Number of obs     =      4,794
                                                F(66, 70)         =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0373
                                                Root MSE          =     .25492

                              (Std. Err. adjusted for 71 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
   interview |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    boxwhite |  -.0360046    .013219    -2.72   0.008     -.062369   -.0096402
       white |   .0323301   .0144355     2.24   0.028     .0035394    .0611208
         box |     .00563   .0082753     0.68   0.499    -.0108745    .0221346
         ged |   .0026102   .0052072     0.50   0.618    -.0077752    .0129956
      empgap |   .0015044   .0056021     0.27   0.789    -.0096686    .0126774
             |
      center |
          2  |   .0301375   .0643144     0.47   0.641    -.0981336    .1584086
          3  |    .090037   .0415115     2.17   0.033     .0072449     .172829
          4  |   .0348114   .0404556     0.86   0.392    -.0458747    .1154975
          5  |  -.0208905   .0217363    -0.96   0.340    -.0642423    .0224613
          6  |  -.0135732   .0223391    -0.61   0.545    -.0581271    .0309808
          7  |   .0048071   .0375588     0.13   0.899    -.0701016    .0797158
          8  |  -.0055563    .026297    -0.21   0.833    -.0580041    .0468914
          9  |   .0033822   .0323394     0.10   0.917    -.0611166     .067881
         10  |  -.0258268   .0231514    -1.12   0.268    -.0720009    .0203473
         11  |   .0309577   .0390579     0.79   0.431    -.0469409    .1088562
         12  |   .0341737   .0548576     0.62   0.535    -.0752363    .1435837
         13  |  -.0395929   .0183076    -2.16   0.034    -.0761063   -.0030796
         14  |  -.0152533   .0190829    -0.80   0.427    -.0533129    .0228063
         15  |   .0183385   .0287668     0.64   0.526     -.039035    .0757121
         16  |  -.0123441   .0155526    -0.79   0.430    -.0433628    .0186745
         17  |   .0409085   .0520716     0.79   0.435     -.062945     .144762
         18  |  -.0411735   .0189272    -2.18   0.033    -.0789225   -.0034244
         19  |       .006   .0363028     0.17   0.869    -.0664037    .0784037
         20  |  -.0253043   .0229014    -1.10   0.273    -.0709798    .0203712
         21  |   .1102271   .0661071     1.67   0.100    -.0216193    .2420735
         22  |   .0080596   .0236148     0.34   0.734    -.0390387    .0551578
         23  |  -.0254779   .0234791    -1.09   0.282    -.0723055    .0213498
         24  |   .0331341   .0340015     0.97   0.333    -.0346798     .100948
         25  |   .0390086   .0449533     0.87   0.388    -.0506478     .128665
         26  |   .0970715   .0390537     2.49   0.015     .0191813    .1749617
         27  |   .0733857   .0535292     1.37   0.175    -.0333749    .1801462
         28  |   .0912348   .0600417     1.52   0.133    -.0285146    .2109842
         29  |   .0326497   .0547756     0.60   0.553    -.0765967    .1418962
         30  |   -.018497   .0225397    -0.82   0.415     -.063451     .026457
         31  |   .0894108   .0727068     1.23   0.223    -.0555983    .2344199
         32  |   .0359392   .0373645     0.96   0.339    -.0385819    .1104603
         33  |   .0129702   .0281255     0.46   0.646    -.0431243    .0690647
         34  |  -.0116422   .0281969    -0.41   0.681    -.0678791    .0445948
         35  |  -.0096239   .0252354    -0.38   0.704    -.0599544    .0407065
         36  |   .0113247   .0376031     0.30   0.764    -.0636724    .0863218
         37  |   .0344601   .0398991     0.86   0.391    -.0451161    .1140363
         38  |   .0316441   .0508247     0.62   0.536    -.0697224    .1330107
         39  |   .0044564    .038956     0.11   0.909    -.0732389    .0821517
         40  |   .0794235   .0517821     1.53   0.130    -.0238526    .1826996
         41  |   .0216039   .0554047     0.39   0.698    -.0888972     .132105
         42  |   .0189119   .0396576     0.48   0.635    -.0601828    .0980065
         43  |   .0386746   .0425632     0.91   0.367    -.0462151    .1235642
         44  |   .0853635   .0735973     1.16   0.250    -.0614216    .2321487
        101  |   .0412234    .059051     0.70   0.487    -.0765502    .1589969
        102  |   .0580661   .0529924     1.10   0.277    -.0476238     .163756
        103  |   -.039768   .0186567    -2.13   0.037    -.0769775   -.0025584
        104  |   .0266103   .0295003     0.90   0.370    -.0322262    .0854467
        105  |  -.0005422   .0230203    -0.02   0.981    -.0464547    .0453703
        106  |   .0337154   .0417382     0.81   0.422    -.0495288    .1169596
        107  |   .0368909   .0446179     0.83   0.411    -.0520967    .1258784
        108  |   .0949007   .0614256     1.54   0.127    -.0276088    .2174102
        109  |   .2420134   .1163919     2.08   0.041     .0098769    .4741498
        110  |   -.014152   .0208238    -0.68   0.499    -.0556837    .0273797
        111  |  -.0186377       .025    -0.75   0.458    -.0684987    .0312233
        112  |    .089996   .0773247     1.16   0.248    -.0642233    .2442152
        113  |   .0002797   .0316258     0.01   0.993     -.062796    .0633554
        114  |  -.0113452   .0351211    -0.32   0.748    -.0813919    .0587016
        115  |   .0120271   .0517717     0.23   0.817    -.0912282    .1152824
        116  |   .0499553   .0311877     1.60   0.114    -.0122467    .1121572
        117  |   .0080699   .0342763     0.24   0.815     -.060292    .0764318
        118  |   .0773955    .111181     0.70   0.489    -.1443479    .2991389
        119  |   .0377196    .044867     0.84   0.403    -.0517648     .127204
        120  |   .1104226    .050246     2.20   0.031       .01021    .2106352
        121  |   .0164461   .0287401     0.57   0.569    -.0408742    .0737663
        122  |   .0174398   .0400674     0.44   0.665    -.0624722    .0973517
        123  |   .0432541   .0185626     2.33   0.023     .0062321     .080276
        124  |   .0666153    .044191     1.51   0.136    -.0215209    .1547514
        125  |   .1371895   .0472792     2.90   0.005     .0428941     .231485
        126  |   .1923111   .0959765     2.00   0.049      .000892    .3837301
        127  |  -.0415028   .0189816    -2.19   0.032    -.0793603   -.0036452
        128  |   -.040895   .0195326    -2.09   0.040    -.0798516   -.0019383
        129  |   .0670219   .0399892     1.68   0.098    -.0127341    .1467779
        130  |    .016848   .0383483     0.44   0.662    -.0596353    .0933314
        131  |   .0503973   .0547844     0.92   0.361    -.0588667    .1596613
        132  |   .0215933   .0645013     0.33   0.739    -.1070505     .150237
        133  |  -.0394724   .0185017    -2.13   0.036     -.076373   -.0025719
        134  |   .0054781   .0468602     0.12   0.907    -.0879816    .0989377
        135  |   .1299313    .047026     2.76   0.007     .0361409    .2237216
        136  |   .0943603   .0995873     0.95   0.347    -.1042603    .2929809
        137  |   .0311913   .0482955     0.65   0.520     -.065131    .1275136
        138  |   -.014592   .0279842    -0.52   0.604    -.0704047    .0412207
        139  |   .1303931   .0903003     1.44   0.153    -.0497052    .3104914
        140  |    .066929   .0422572     1.58   0.118    -.0173504    .1512083
             |
       _cons |   .0280431   .0165234     1.70   0.094    -.0049118    .0609979
------------------------------------------------------------------------------

. estimates store mod23

. // col 4: prewhite, only box remover and balanced observations
. regress interview prewhite white pre ged empgap if balanced == 1 & remover == 0, cluster(chain_id)

Linear regression                               Number of obs     =      7,476
                                                F(5, 180)         =       2.30
                                                Prob > F          =     0.0466
                                                R-squared         =     0.0014
                                                Root MSE          =      .2302

                             (Std. Err. adjusted for 181 clusters in chain_id)
------------------------------------------------------------------------------
             |               Robust
   interview |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
    prewhite |  -.0023673   .0086462    -0.27   0.785    -.0194283    .0146937
       white |   .0158078   .0067962     2.33   0.021     .0023972    .0292183
         pre |   -.005797   .0155183    -0.37   0.709    -.0364181    .0248241
         ged |  -.0037052   .0054155    -0.68   0.495    -.0143912    .0069809
      empgap |  -.0047109   .0039089    -1.21   0.230     -.012424    .0030023
       _cons |     .05596   .0200913     2.79   0.006     .0163152    .0956047
------------------------------------------------------------------------------

. estimates store mod25

. // gen table
. esttab  mod21 mod22 mod23 mod25 using "result_i", ///
> rtf replace se ///
> stats(N, labels("N")) ///
> drop(_cons *.center ged empgap)
(output written to result_i.rtf)

. 
. 
. //Question (j)
. 
. // do new tables to show the regression results with calculated t-test
. // table d&e
. esttab model_1 model_2, drop(_cons *.center *.chain_id)

--------------------------------------------
                      (1)             (2)   
              posresponse     posresponse   
--------------------------------------------
white              0.0242***    -0.000868   
                   (4.30)         (-0.09)   

crime             -0.0129*        -0.0520***
                  (-2.36)         (-4.23)   

ged              -0.00519          0.0105   
                  (-1.03)          (0.78)   

empgap            0.00125          0.0103   
                   (0.27)          (1.02)   

pre               -0.0151                   
                  (-1.48)                   
--------------------------------------------
N                   14637            2918   
--------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. esttab model_3 model_4, drop(_cons *.center *.chain_id)

--------------------------------------------
                      (1)             (2)   
                interview       interview   
--------------------------------------------
white              0.0135**      -0.00740   
                   (2.87)         (-1.17)   

crime            -0.00931*        -0.0353***
                  (-2.03)         (-5.64)   

ged              -0.00239      -0.0000279   
                  (-0.71)         (-0.00)   

empgap           -0.00305         0.00662   
                  (-1.06)          (0.92)   

pre              -0.00715                   
                  (-0.78)                   
--------------------------------------------
N                   14637            2918   
--------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. // table h&i
. esttab  mod1 mod2 mod3 mod5, drop(_cons *.center ged empgap)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
              posresponse     posresponse     posresponse     posresponse   
----------------------------------------------------------------------------
boxwhite          -0.0302*        -0.0364*        -0.0327*                  
                  (-1.98)         (-2.62)         (-2.37)                   

white              0.0315**        0.0442***       0.0401**        0.0221*  
                   (2.63)          (3.51)          (3.42)          (2.51)   

box                0.0150         0.00317        -0.00175                   
                   (0.61)          (0.21)         (-0.13)                   

prewhite                                                          0.00203   
                                                                   (0.15)   

pre                                                               -0.0159   
                                                                  (-0.91)   
----------------------------------------------------------------------------
N                    7245            3712            4794            7476   
----------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. esttab  mod21 mod22 mod23 mod25, drop(_cons *.center ged empgap)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                interview       interview       interview       interview   
----------------------------------------------------------------------------
boxwhite          -0.0262**       -0.0409*        -0.0360**                 
                  (-2.60)         (-2.51)         (-2.72)                   

white              0.0169*         0.0399*         0.0323*         0.0158*  
                   (2.41)          (2.20)          (2.24)          (2.33)   

box                0.0226          0.0108         0.00563                   
                   (1.46)          (1.19)          (0.68)                   

prewhite                                                         -0.00237   
                                                                  (-0.27)   

pre                                                              -0.00580   
                                                                  (-0.37)   
----------------------------------------------------------------------------
N                    7245            3712            4794            7476   
----------------------------------------------------------------------------
t statistics in parentheses
* p<0.05, ** p<0.01, *** p<0.001

. 
. 
. /*      =============================================================
>         ============    FINAL COMMANDS  (do not change) ============
>         ============================================================= */
.         
. log close
      name:  <unnamed>
       log:  /Users/nisailing/Desktop/ECO372/ECO372_A4/ECO372_Assignment4_NI_Sailing.log
  log type:  text
 closed on:  14 Apr 2021, 09:55:21
------------------------------------------------------------------------------------------------------
